function Dsy(){
	this.Items = {};
};
Dsy.prototype.add = function(id,iArray){
	this.Items[id] = iArray;
};
Dsy.prototype.Exists = function(id){
	if(typeof(this.Items[id]) == "undefined") return false;
	return true;
};

var dsy = new Dsy();
					//0       1      2	  3			4      5	  6			7	  8		  9			10		11		12		13		14		15		16		17		18		   19		20		21		22		23		24		25		26	   27		28		29		30
//dsy.add("0", ["北京", "上海", "天津", "重庆", "广东", "广西", "贵州", "海南", "河北", "河南", "黑龙江", "湖北", "湖南", "吉林", "江苏", "江西", "辽宁", "内蒙古", "宁夏", "青海", "山东", "山西", "陕西", "四川", "西藏", "新疆", "云南", "浙江", "甘肃", "安徽", "福建"]);


/*dsy.add("0", [
	//'A-G'
	['安徽省', '北京市','重庆市','福建省', '甘肃省','广东省', '广西壮族自治区', '贵州省'],
	//'H-K'
	['海南省','河北省', '黑龙江省', '河南省', '湖北省','湖南省','江苏省','江西省','吉林省'],
	//'L-S'
	['辽宁省','内蒙古自治区','宁夏回族自治区','青海省','山东省','上海市','山西省','陕西省','四川省'],
	//'T-Z'
	['天津市', '新疆维吾尔自治区','西藏自治区','云南省','浙江省']
]);*/


dsy.add("0_0", ["北京"]);
dsy.add("0_0_0", ["东城区", "西城区", "宣武区", "房山区", "崇文区", "海淀区", "朝阳区", "丰台区", "门头沟区", "石景山区", "通州区", "顺义区", "昌平区", "大兴区", "怀柔区", "平谷区", "密云县", "延庆县"]);
dsy.add("0_0_0_0", ["安定门", "北新桥", "北京站", "朝阳门", "东直门", "东四十条", "东四", "西单", "灯市口", "东直门外", "鼓楼", "和平里", "海运仓", "交道口", "建国门", "景山", "沙滩", "王府井", "雍和宫", "其他"]);
dsy.add("0_0_0_1", ["百万庄", "车公庄", "德胜门", "地安门", "复兴门", "阜成门", "官园", "鼓楼", "后海", "积水潭", "金融街", "六铺坑", "木樨地", "马甸", "南礼士街", "什刹海", "三里河", "西直门", "新街口", "小西天", "西四", "西单", "西便门", "月坛", "展览路", "真武庙", "其他"]);
dsy.add("0_0_0_2", ["白纸坊", "白广路", "长椿街", "菜市口", "椿树街道", "大观园", "大栅栏", "广安门", "广安门外", "广安门内", "红莲", "虎坊桥", "和平门", "马连道", "南菜园", "牛街", "前门", "陶然亭", "天桥", "天宁寺", "西客站", "宣武门", "左安门", "右安门", "珠市口", "其他"]);
dsy.add("0_0_0_3", ["长阳", "窦店", "房山城关", "韩村河", "良乡", "琉璃河", "石楼", "阎村", "迎风", "燕山", "周口店", "其他"]);
dsy.add("0_0_0_4", ["崇文门", "磁器口", "东花市", "法华寺", "广渠门", "光明楼", "花市", "龙潭湖", "前门", "沙子口", "体育馆路", "天坛", "新世界", "永定门", "其他"]);
dsy.add("0_0_0_5", ["安宁庄", "北大清华", "北太平庄", "白石桥", "北洼路", "北航", "车道沟", "厂洼", "大钟寺", "定慧寺", "二里庄", "恩济寺", "甘家口", "公主坟", "花园桥", "航天桥", "蓟门桥", "交通大学", "军傅", "金沟河", "联想桥", "马连洼", "牡丹园", "马甸", "明光桥", "清河", "人民大学", "上地", "苏州街", "双榆树", "世纪城", "四季春", "苏州桥", "田村", "万泉河", "五道口", "万柳", "魏公村", "万寿寺", "万寿路", "五棵松", "五路居", "小营", "西三旗", "西二旗", "西北旺", "西苑", "学院路", "西直门", "香山", "西八里庄", "西山", "学院路北", "肖家河", "永定路", "玉泉路", "中关村", "知春路", "皂君庙", "紫竹路", "增光路", "其他"]);
dsy.add("0_0_0_6", ["奥运村", "安慧桥", "安贞", "北苑", "北沙滩", "百子湾", "八里庄", "北工大", "朝阳公园", "朝外", "CBD", "朝青板块", "常营", "大山子", "大屯", "东大桥", "大望路", "东坝", "定福庄", "豆各庄", "垡头", "国展", "工体", "国贸", "甘露园", "高碑店", "管庄", "国美第一城", "花家地", "和平街", "惠新里", "呼家楼", "华威桥", "红庙", "华纺易城", "惠新西街", "欢乐谷", "红军营南路", "酒仙桥", "健翔桥", "建外大街", "劲松", "来广营", "柳芳", "媒体村", "南磨房", "南沙滩", "潘家园", "芍药居", "三元桥", "水碓子", "三里屯", "双井", "四惠", "石佛营", "十里堡", "双桥", "十八里店", "十里河", "孙河", "太阳宫", "甜水园", "团结湖", "望京", "小营", "小关", "西坝河", "小红门", "亚运村", "燕莎", "姚家园", "永安里", "左家庄", "其他"]);
dsy.add("0_0_0_7", ["北大地", "菜户营", "草桥", "成寿寺", "长辛店", "大红门", "东高地", "东大街", "东铁匠营", "方庄", "丰台路", "丰台体育馆", "丰益桥", "和义", "花乡", "角门", "嘉园", "科技园区", "看丹桥", "科丰桥", "六里地", "丽泽桥", "刘家窑", "卢沟桥", "莲花池", "马连道", "马家堡", "木樨园", "南苑", "蒲黄榆", "七里店", "青塔", "宋家庄", "世界公园", "石榴庄", "太平桥", "五里店", "王佐", "西客站", "西罗园", "新发地", "新宫", "玉泉营", "右安门", "洋桥", "岳各庄", "云冈", "怡海花园", "赵公口", "左安门", "总部基地", "其他"]);
dsy.add("0_0_0_8", ["城子街道", "大峪", "东辛房", "军庄", "龙泉", "妙峰山", "清水", "潭拓寺", "永定", "其他"]);
dsy.add("0_0_0_9", ["八宝山", "八角", "八大处", "古城", "广宁", "金顶街", "老山", "鲁谷", "模式口", "苹果园", "五里蛇", "西山", "玉泉路", "衙门口", "杨庄", "永乐", "其他"]);
dsy.add("0_0_0_10", ["北关环岛", "北苑", "北关", "八里街", "八通轻轨沿线", "次渠", "东关", "果园", "九棵树", "漷县", "梨园", "梨园城铁", "临河里", "潞城", "潞苑", "马驹桥", "乔庄", "土桥", "武夷花园", "新华大街", "西门", "玉桥", "永顺", "运河大街", "中仓", "张家湾", "其他"]);
dsy.add("0_0_0_11", ["光明", "后沙峪", "机场", "建新", "李桥", "马坡", "南彩", "南法信", "仁和", "胜利", "石园", "顺义城区", "天竺", "新国展", "杨镇", "裕龙", "中央别墅区", "其他"]);
dsy.add("0_0_0_12", ["北七家", "百善", "昌平县城", "城北", "城南", "长陵", "东小口", "回龙观", "霍营", "龙泽", "立水桥", "马池口", "南口", "南邵", "南邵镇", "沙河镇", "十三陵", "沙河", "天通苑", "小汤山", "兴寿", "阳坊", "其他"]);
dsy.add("0_0_0_13", ["滨河", "观音寺", "高米店", "黄村", "海子角", "旧宫", "林校路", "庞各庄", "清源", "生物医药基地", "同兴园", "西红门", "新宫", "兴丰大街", "兴华大街", "兴业大街", "亦庄", "郁花园", "瀛海镇", "其他"]);
dsy.add("0_0_0_14", ["北房", "渤海镇", "怀柔", "柔北", "怀柔城区", "九渡河", "庙城", "泉河", "桥梓", "汤河口", "杨宋", "雁栖", "其他"]);
dsy.add("0_0_0_15", ["滨河", "滨河路", "东高村", "黄松峪", "金海湖", "刘家店", "马昌营", "平谷镇", "平谷城区", "王辛庄", "兴谷", "熊儿寨", "渔阳", "峪口", "镇罗营", "其他"]);
dsy.add("0_0_0_16", ["北庄", "不老屯", "古北口", "密云", "穆家峪", "密云城区", "十里堡", "太师屯", "溪翁壮", "新城子", "其他"]);
dsy.add("0_0_0_17", ["八达岭", "大榆树", "康庄", "延庆", "永宁", "延庆城区", "其他"]);

dsy.add("0_1",["上海"]);
dsy.add("0_1_0", ["黄浦区", "卢湾区", "静安区", "徐汇区", "虹口区", "长宁区", "普陀区", "闸北区", "杨浦区", "浦东新区", "宝山区", "嘉定区", "闵行区", "松江区", "青浦区", "南汇区", "奉贤区", "金山区", "崇明县", "其他"]);
dsy.add("0_1_0_0", ["半淞园路", "董家渡", "黄浦滨江", "老西门", "南京东路", "南外滩", "蓬莱公园", "人民广场", "外滩", "西藏南路", "豫园", "其他"]);
dsy.add("0_1_0_1", ["打浦桥", "复兴公园", "淮海中路", "鲁班路", "世博滨江", "五里桥", "新天地", "其他"]);
dsy.add("0_1_0_2", ["北京西路", "曹家渡", "昌平路", "静安寺", "江宁路", "南京西路", "西康路", "新闸路", "其他"]);
dsy.add("0_1_0_3", ["漕宝路地铁", "长桥", "漕河泾", "复兴中路", "枫林路", "淮海西路", "湖南路", "华东理工", "华泾", "衡山路", "交大", "建国西路", "康健", "龙华", "凌云路", "上师大", "上海南站", "田林", "万体馆", "徐家汇", "斜土路", "襄阳南路", "肇嘉浜路", "植物园", "其他"]);
dsy.add("0_1_0_4", ["北外滩", "大柏树", "广中路", "和平公园", "江湾", "凉城", "鲁迅公园", "临平路", "曲阳路", "四川北路", "四平路", "提篮桥", "周家嘴路", "其他"]);
dsy.add("0_1_0_5", ["北新泾", "程家桥", "动物园", "古北", "虹桥", "虹桥火车站", "江苏路地铁", "上海影城", "天山路", "新华路", "仙霞新村", "镇宁路", "中山公园", "周家桥", "其他"]);
dsy.add("0_1_0_6", ["长寿路", "曹杨新村", "长风新村", "长征", "光新", "甘泉路", "华师大", "金沙江路", "李子园", "石泉路", "桃浦", "武宁路", "万里城", "宜川路", "中远两湾城", "真光新村", "真如", "其他"]);
dsy.add("0_1_0_7", ["宝山路", "大宁路", "共和新路", "和田", "老北站", "彭浦", "天目西路", "汶水路", "新客站", "西藏北路", "延长路", "芷江西路", "闸北公园", "其他"]);
dsy.add("0_1_0_8", ["鞍山", "长白新村", "长阳路", "东外滩", "复旦大学", "黄兴", "控江路", "平凉路", "四平路", "五角场", "新江湾城", "新华医院", "杨浦公园", "杨浦大桥", "中原", "周家嘴路", "其他"]);
dsy.add("0_1_0_9", ["八佰伴", "北蔡", "碧云", "曹路", "川沙", "昌里", "东昌站地铁", "东方路地铁", "东明路", "高行", "高桥", "花木", "合庆", "金杨新村", "金桥", "陆家嘴", "六里", "联洋", "龙阳路地铁站", "梅园", "南码头", "浦东外环", "上钢新村", "上南新村", "三林", "世纪公园", "世博滨江", "塘桥", "唐镇", "潍坊", "外高桥", "王港", "源深竹园", "杨东", "洋泾", "御桥", "周家渡", "张江", "竹园商贸区", "其他"]);
dsy.add("0_1_0_10", ["大华", "大场", "东城区", "顾村", "共富", "共康", "高境", "锦秋花园", "罗店", "罗泾", "刘行", "罗南", "庙行", "上大", "泗塘", "淞南", "淞宝", "水产路", "通河新村", "通河西城区", "吴淞", "杨行", "友谊路", "月浦", "张庙", "其他"]);
dsy.add("0_1_0_11", ["安亭", "曹王", "丰庄", "封浜", "黄渡", "华亭", "江桥", "嘉定城区", "嘉定镇", "菊园新区", "金鹤新城", "娄唐", "马陆", "南翔", "唐行", "外冈", "新城", "徐行", "真新新村", "朱桥", "其他"]);
dsy.add("0_1_0_12", ["北桥", "漕宝路", "春申", "东兰新村", "凤溪", "古美罗阳", "华漕", "航华", "虹桥", "虹梅路", "金虹桥", "静安新城", "江川路", "纪王", "龙铂金汇", "老闵行", "梅陇", "马桥", "南方新城", "浦江", "七宝", "蔷薇新村", "七莘路", "莘庄工业区", "吴泾", "莘庄", "颛桥", "诸翟", "其他"]);
dsy.add("0_1_0_13", ["车墩", "洞泾", "大港", "方松", "九亭", "李塔汇", "练塘", "泖港", "茸北", "莘闵", "泗泾", "佘山", "松江大学城", "松江新城", "松江老城", "松江工业区", "松江科技园", "石湖荡", "天马山", "五库", "新桥", "叶榭", "新浜", "小昆山", "岳阳", "永丰", "中山", "其他"]);
dsy.add("0_1_0_14", ["白鹤", "华新", "华新镇", "金泽", "青浦新城", "青浦北部", "青浦工业园区", "徐泾", "香花桥", "夏阳街道", "赵巷", "朱家角", "重固", "赵屯", "其他"]);
dsy.add("0_1_0_15", ["航头", "惠南", "康桥", "临港新城", "芦潮港", "泥城", "新场", "周浦", "祝桥", "其他"]);
dsy.add("0_1_0_16", ["奉城", "海湾", "海湾旅游区", "金汇", "南桥", "西渡", "庄行", "柘林", "其他"]);
dsy.add("0_1_0_17", ["漕泾", "枫泾", "干巷", "金山新城", "金山卫", "金山中部", "金山工业园", "吕巷", "石化", "山阳", "亭林", "新农", "朱泾", "张堰", "朱行", "其他"]);
dsy.add("0_1_0_18", ["堡镇", "城桥", "崇明", "崇明新城", "陈家镇", "长兴岛", "横沙岛", "其他"]);

dsy.add("0_2",["天津"]);
dsy.add("0_2_0", ["和平区", "河东区", "河西区", "南开区", "河北区", "红桥区", "塘沽区", "汉沽区", "大港区", "开发区", "东丽区", "西青区", "北辰区", "津南区", "武清区", "蓟县", "宝坻区", "宁河县", "静海县", "滨海新区"]);
dsy.add("0_2_0_0", ["滨江道", "和平周边", "南营门", "南市", "劝业场", "体育馆", "小白楼", "新兴街"])
dsy.add("0_2_0_1", ["春华街", "常州道", "程琳", "大王庄", "大直沽", "大桥道", "东新街", "二号桥", "富民路", "河东周边", "鲁山道", "上杭路", "唐口", "唐家口", "铁厂", "向阳楼", "中山门", "张贵庄", "其他"]);
dsy.add("0_2_0_2", ["陈塘庄", "大营门", "东海街", "挂甲寺", "河西周边", "尖山", "柳林", "马场", "梅江", "桃园街", "天塔", "土城", "下瓦房", "小海地", "越秀路", "友谊路", "其他"]);
dsy.add("0_2_0_3", ["八里台", "长虹街", "鼓楼", "广开街", "华苑", "黄河道", "花园南", "嘉陵道", "密云路", "南开周边", "荣业大街", "体育中心", "天拖南", "王项南", "万兴街", "学府街", "兴南街", "向阳路", "其他"]);
dsy.add("0_2_0_4", ["光复道", "鸿顺里", "河北周边", "建昌道", "江都路", "靖江路", "宁园", "铁东路", "望海楼", "王串场", "新开河", "月牙河", "其他"]);
dsy.add("0_2_0_5", ["丁字沽", "大胡同", "红桥周边", "茶园道", "铃铛阁", "双环村", "邵公庄", "三条石", "咸阳北路", "西于庄", "西沽", "其他"]);
dsy.add("0_2_0_6", ["渤海石油", "北塘路", "大沽街", "工农村", "杭州道", "胡家园", "解放路", "三槐路", "塘沽新村街", "塘沽周边", "新港", "新河街", "新城", "新村街", "其他"]);
dsy.add("0_2_0_7", ["茶淀", "大田", "汉沽", "河西", "天化", "盐场", "营城", "杨家泊", "寨上", "其他"]);
dsy.add("0_2_0_8", ["古林街", "港西", "海滨", "胜利街", "太平", "小王庄", "迎宾路", "中塘", "其他"]);
dsy.add("0_2_0_9", ["第一大街", "第二大街", "第三大街", "第四大街", "第五大街", "鲲鹏街", "开发周边", "其他"]);
dsy.add("0_2_0_10", ["程林庄", "大毕庄", "东丽周边", "东丽湖", "丰年路", "华明", "津塘路", "军粮城", "利津路", "无暇", "先锋路", "新历", "么六桥", "张贵庄", "其他"]);
dsy.add("0_2_0_11", ["大寺", "候台", "李七庄", "南河", "王文装", "辛口", "西营门", "西青周边", "杨柳青", "中北", "张家窝", "其他"]);
dsy.add("0_2_0_12", ["北仓", "北辰周边", "大张庄", "果园新村", "红光农场", "集贤里", "普东", "青光", "双街", "双口", "天穆", "小淀", "宜兴埠", "西提头", "其他"]);
dsy.add("0_2_0_13", ["八百里", "北闸口", "葛沽", "津南周边", "双港", "双桥河", "咸水沽", "小站", "辛庄", "其他"]);
dsy.add("0_2_0_14", ["白古屯", "汊沽港", "陈嘴", "崔黄口", "城关", "曹子营", "东蒲洼", "东马圈", "大良", "大碱厂", "大孟庄", "大王古庄", "豆张庄", "大黄堡", "高村", "黄庄", "黄花庄", "河北屯", "河西务", "梅厂", "南蔡村", "石各庄", "上马台", "泗村店", "王庆坨", "徐官屯", "下朱庄", "下武旗", "杨村", "运河西", "其他"]);
dsy.add("0_2_0_15", ["八门城", "城关", "大口屯", "大白庄", "大钟装", "大唐庄", "尔王庄", "方家庄", "高家庄", "黄庄", "郝各庄", "口东", "林亭口", "马家店", "牛道口", "牛家牌", "史各庄", "王卜庄", "新开口", "新安", "周良庄", "其他"]);
dsy.add("0_2_0_16", ["白涧", "邦均", "别山", "城关", "出头岭", "穿芳峪", "东赵各庄", "东二营", "管庄", "侯家营", "罗庄子", "礼明庄", "马伸桥", "桑梓", "施古", "上仓", "孙各庄满族", "文昌街道", "五百户", "下营", "西龙虎峪", "下窝头", "下仓", "许家台", "洇溜", "尤古庄", "杨津庄", "其他"]);
dsy.add("0_2_0_17", ["陈官屯", "蔡公庄", "独流", "大丰堆", "大邱庄", "大邱庄", "梁头", "良王庄", "双塘", "台头", "唐官屯", "团泊", "王口", "西翟庄", "沿庄", "杨成庄", "子牙", "中旺", "其他"]);
dsy.add("0_2_0_18", ["板桥", "俵口", "北淮淀", "东棘坨", "大北涧沽", "丰台", "芦台", "廉庄", "芦台经济开发区", "苗庄", "宁河", "潘庄", "七里海", "清河农场", "岳龙", "造甲城", "其他"]);
dsy.add("0_2_0_19", ["其他"]);

dsy.add("0_3",["重庆"]);
dsy.add("0_3_0", ["万州区", "涪陵区", "渝中区", "大渡口区", "江北区", "沙坪坝区", "九龙坡区", "南岸区", "北碚区", "万盛区", "双桥区", "渝北区", "巴南区", "黔江区", "长寿区", "城口县", "大足县", "垫江县", "丰都县", "奉节县", "合川市", "江津区", "开县", "梁平县", "南川市", "彭水苗族土家族自治县", "荣昌县", "石柱土家族自治县", "铜梁县", "巫山县", "巫溪县", "武隆县", "秀山土家族苗族自治县", "永川市", "酉阳土家族苗族自治县", "云阳县", "忠县", "潼南县", "璧山县", "綦江县"]);
dsy.add("0_3_0_0", ["白土", "白羊", "百安坝", "长坪", "茨竹", "长岭", "长滩", "陈家坝", "宝地", "大周", "弹子", "凤仪", "分水", "郭村", "高峰", "甘宁", "高粱", "高笋塘", "黄柏", "恒合土家族", "后山", "九池", "梨树", "龙沙", "李河", "龙驹", "罗田", "龙都", "普子", "牌楼", "瀼渡", "孙家", "双口河", "沙河", "铁峰", "天成", "太安", "太龙", "太白", "武陵", "五桥", "西口", "响水", "熊家", "小周", "新田", "新镇", "燕山", "余家", "柱山", "走马", "周家坝", "钟鼓楼", "其他"]);
dsy.add("0_3_0_1", ["百胜", "白涛", "堡子", "崇义", "丛林", "敦仁", "惠民", "江东", "江北", "焦石", "酒店", "卷洞", "荔枝", "李渡", "龙潭", "蔺市", "龙桥", "龙塘", "罗云", "两汇", "马武", "明家", "南沱", "清溪", "仁义", "石沱", "山窝", "石龙", "同乐", "新秒", "义和", "珍溪", "镇安", "致韩", "增福", "中峰", "其它"]);
dsy.add("0_3_0_2", ["朝天门", "菜园坝", "大溪沟", "大坪", "观音岩", "黄沙溪", "化龙桥", "解放碑", "较场口", "两路口", "李子坝", "南纪门", "七星岗", "上清寺", "望龙门", "王家坡", "袁家岗", "一号桥", "渝中周边", "其它"]);
dsy.add("0_3_0_3", ["步行街", "八桥", "春晖路", "九宫庙", "建胜", "茄子溪", "跳磴", "新山村", "跃进村", "其它"]);
dsy.add("0_3_0_4", ["北滨路", "存滩", "大石坝", "复盛", "观音桥", "郭家沱", "华新街", "红旗河沟", "黄泥滂", "江北城", "江北周边", "南桥寺", "石马河", "铁山坪", "五里店", "五宝", "鱼嘴", "其它"]);
dsy.add("0_3_0_5", ["磁器口", "陈家桥", "曾家", "大学城", "凤凰", "凤天路", "歌乐山", "工人村", "虎溪", "回龙坝", "汉渝路", "井口", "劳动路", "青木关", "沙坝坪", "石井坡", "山洞", "三峡广场", "沙滨路", "沙正陆", "双碑", "沙坪坝周边", "童家桥", "天星桥", "土湾", "覃家岗", "土主", "小龙坎", "新桥", "西永", "渝培路", "杨公桥", "詹家溪", "中梁", "其他"]);
dsy.add("0_3_0_6", ["白市驿", "巴福", "陈家坪", "二郎", "黄桷坪", "华岩", "含谷", "九龙", "九凤", "九龙坡周边", "石坪桥", "石桥铺", "石板", "铜罐驿", "陶家", "谢家湾", "西彭", "杨家坪", "渝州路", "中梁山", "走马", "其他"]);
dsy.add("0_3_0_7", ["长生桥", "茶园新区", "弹子石", "大佛段", "光阳", "海棠溪", "花园路", "黄桷桠", "回龙湾", "鸡冠石", "经开区", "龙门浩", "南坪", "南滨路", "南岸周边", "四公里", "铜元局", "涂山", "峡口", "学府大道", "玄坛庙", "迎龙", "其他"]);
dsy.add("0_3_0_8", ["北温泉", "朝阳", "澄江", "蔡家岗", "城北新区", "城南新区", "东阳", "复兴", "静观", "金刀峡", "龙凤桥", "柳荫", "偏岩", "施家梁", "水土", "三圣", "石坝", "天生", "天府", "童家溪", "歇马", "其他"]);
dsy.add("0_3_0_9", ["丛林", "东林", "关坝", "金桥", "景星", "南桐", "南天", "青年", "万东", "其他"]);
dsy.add("0_3_0_10", ["龙潭子", "双路", "通桥", "其他"]);
dsy.add("0_3_0_11", ["茨竹", "大竹林", "大湾", "大胜", "古路", "高嘴", "回兴", "花卉园", "华釜山", "加州新牌坊", "空港新城", "龙溪", "礼嘉", "龙头寺", "龙兴", "洛碛", "两路", "木耳", "麻柳沱", "明月", "农业园区", "汽博中心", "人和", "冉家坝", "双凤桥", "双龙湖", "石坪", "石船", "沙坪", "王家", "新溉路", "兴隆", "鸳鸯", "一碗水", "御临", "悦来", "玉峰山", "渝北周边", "张关", "中河", "其他"]);
dsy.add("0_3_0_12", ["安澜", "东泉", "二圣", "丰盛", "花溪", "慧明", "界石", "姜家", "接龙", "李家沱", "龙州湾新区", "木洞", "麻柳嘴", "南泉", "南彭", "双河口", "石滩", "石龙", "跳石", "天星寺", "鱼洞", "一品", "其他"]);
dsy.add("0_3_0_13", ["百合", "白石", "白土", "鹅池", "冯家坝", "工农", "黑溪", "后坝", "黄溪", "九龙", "金溪", "金洞", "联合", "两河", "犁弯", "邻鄂", "马喇", "南海", "浦花", "平溪", "蓬东", "青冈", "沙坝", "石会", "水市", "石家河", "杉岭", "石钟", "水田", "渗坝", "太极", "五里", "西泡", "县坝", "小庄", "学堂", "新安", "新华", "新华", "新民", "杨柳", "濯水", "中塘", "栅山", "舟白", "濯西", "早化", "寨子", "正阳", "其它"]);
dsy.add("0_3_0_14", ["八颗", "长寿湖", "但渡", "渡舟", "凤城", "葛兰", "海棠", "洪湖", "江南", "邻封", "龙河", "双龙", "石堰", "万顺", "新市", "晏家", "云集", "云台", "其它"]);


dsy.add("0_4", ["广州", "深圳", "潮州", "东莞", "佛山", "河源", "惠州", "江门", "揭阳", "茂名", "梅州", "清远", "汕头", "汕尾", "韶关", "阳江", "云浮", "湛江", "肇庆", "中山", "珠海"]);
dsy.add("0_4_0", ["从化市", "增城区", "荔湾区", "越秀区", "海珠区", "天河区", "白云区", "黄埔区", "番禺区", "花都区", "萝岗", "南沙区", "其他"]);
dsy.add("0_4_0_0", ["鳌头", "城郊", "街口", "江浦", "良品", "吕田", "太平", "温泉", "其他"]);
dsy.add("0_4_0_1", ["福和", "广园东", "荔城", "派潭", "三江", "沙庄", "新塘", "仙村", "小楼", "永和", "朱村", "中新", "正果", "镇龙", "其他"]);
dsy.add("0_4_0_2", ["白鹤洞", "白鹅潭", "陈家祠", "昌华", "彩虹", "东风西", "多包", "第一津街", "芳村", "逢源", "光复北路", "环市西", "黄沙", "花地湾", "黄岐", "华林", "窖口", "金花", "康王路", "坑口", "荔湾路", "龙津", "龙溪", "岭南", "南岸路", "南源", "桥东", "桥中", "上下九", "沙面", "西村", "西关", "西华路", "站前", "中山八路", "周门", "其他"]);
dsy.add("0_4_0_3", ["北京路", "白云", "东风东", "东山口", "东川", "东风路", "大新", "大沙头", "东湖", "二沙岛", "广卫", "光塔", "环市西", "黄花岗", "环市中", "华乐", "洪桥", "建设", "解放南", "解放北", "流花", "六榕", "梅花村", "农林下路", "农讲所", "盘福路", "区庄", "人民", "水荫路", "诗书", "淘金", "五羊新城", "小北", "西门口", "杨箕村", "中山路", "其他"]);
dsy.add("0_4_0_4", ["滨江东", "滨江", "宝岗", "赤岗", "昌岗", "东晓南", "凤阳", "广州大道南", "工业大道北", "工业大道", "工业大道南", "官洲", "工业大道中", "海幢", "华洲", "江南大道南", "江南西", "江南中", "江南大道中", "江燕路", "江海", "客村", "沥滘", "龙凤", "南华西", "南石头", "南洲", "琶洲", "前进路", "瑞宝", "素社", "沙园", "新港", "新港西", "下渡路", "晓港", "怡乐路", "中大", "其他"]);
dsy.add("0_4_0_5", ["车陂", "长兴", "长湴", "东圃", "登峰", "凤凰", "岗顶", "广州大道中", "黄村", "华景新城", "黄埔大道西", "龙口西", "龙口东", "林和", "龙洞", "前进", "上社", "石碑", "沙河", "沙太南", "沙东", "棠下", "天河公园", "天河北", "体育中心", "体育西路", "天河南", "天河东路", "天平架", "天河客运站", "天园", "棠东", "五山", "猎德", "冼村", "新塘", "兴华", "员村", "粤垦", "元岗", "员村二横路", "珠江新城", "植物园", "珠吉", "中山大道", "其他"]);
dsy.add("0_4_0_6", ["白云大道南", "白云大道北", "广州大道北", "广园路", "桂花岗", "广花", "黄石", "黄边", "鹤边", "机场路", "京溪", "金沙洲", "景泰", "嘉禾望岗", "均禾", "江高", "九佛", "嘉禾", "狂泉", "罗冲围", "龙归", "良田", "梅花园", "南湖", "人和", "三元里", "石井", "沙太北", "神山", "松洲", "同和", "棠景", "同德围", "太和", "伍仙桥", "新市", "西槎路", "永平", "永泰", "远景路", "钟落潭", "竹料", "其他"]);
dsy.add("0_4_0_7", ["长洲", "大沙", "黄埔", "黄埔区府", "红山", "荔联", "南岗", "穗东", "文冲", "鱼珠", "其他"]);
dsy.add("0_4_0_8", ["大石", "东涌", "大岗", "东环", "大学城", "华南", "黄阁", "横沥", "华南碧桂园", "洛溪", "榄核", "灵山", "南浦", "南村", "祈福", "市桥", "石碁", "石楼", "沙头", "顺德碧桂园", "万顷沙", "鱼窝头", "亚运城", "雅居乐", "钟村", "其他"]);
dsy.add("0_4_0_9", ["北兴", "赤坭", "芙蓉", "花城路", "花东", "花山", "花侨", "旧区", "镜湖大道", "建设路", "狮岭", "山前大道", "炭步", "梯面", "铁路西", "新华", "新区", "雅瑶", "其他"]);
dsy.add("0_4_0_10", ["开发东区", "开发西区", "科学城", "萝岗镇", "其他"]);
dsy.add("0_4_0_11", ["其他"]);

dsy.add("0_4_1", ["罗湖区", "福田区", "南山区", "宝安区", "龙岗区", "盐田区", "龙华新区", "光明新区", "坪山新区", "大鹏新区"]);
dsy.add("0_4_1_0", ["布心", "蔡屋围", "翠竹", "草埔", "东门", "独树村", "东湖", "东晓", "国贸", "火车站", "黄贝岭", "洪湖", "红岗花园", "华港新村", "金稻田", "罗湖区委", "莲塘", "留医部", "理想新城", "泥岗", "清水河", "人民南", "水库", "水贝", "笋岗", "田贝", "田心村", "文锦渡", "文锦", "银湖", "其他"]);
dsy.add("0_4_1_1", ["八卦岭", "保税区", "笔架山", "白沙岭", "车公庙", "彩田村", "赤尾", "福田区委", "福民新村", "福华新村", "福田口岸", "岗厦", "购物公园", "华强北", "华强南", "皇岗", "黄木岗", "景田", "莲花一村", "莲花二村", "莲花三村", "莲花北村", "荔枝公园", "上步", "上梅林", "上沙", "沙嘴", "沙尾", "石厦", "下梅林", "香蜜湖", "新洲", "园岭", "益田村", "竹子林", "中心区", "其他"]);
dsy.add("0_4_1_2", ["白石洲", "大冲", "桂庙路口", "华侨城", "海王大厦", "后海", "海上世界", "科技园", "南头", "南山医院", "南新路口", "南油", "前海", "区政府", "深大北门", "蛇口", "深圳湾", "桃源村", "西丽", "中心区", "招商大厦", "其他"]);
dsy.add("0_4_1_3", ["翻身路", "福永", "观澜", "公明", "沙井", "石岩", "松岗", "桃源居", "万科城", "西乡", "新安", "新中心区", "滢水山庄", "中心区", "其他"]);
dsy.add("0_4_1_4", ["布吉关", "布吉", "坂田", "大芬村", "桂芳园", "横岗", "康桥", "可园", "葵涌", "龙岗中心城", "龙珠花园", "南澳", "平湖", "坪地", "其他"]);
dsy.add("0_4_1_5", ["大梅沙", "沙头角", "小梅沙", "盐田", "其他"]);
dsy.add("0_4_1_6", ["大浪", "观澜", "锦绣江南", "龙华", "民治", "梅林关口", "美丽365花园", "潜龙花园", "其他"]);


dsy.add("0_4_2", ["潮安区", "湘桥区", "饶平县"]);
dsy.add("0_4_3", ["石碣镇", "石龙镇", "茶山镇", "石排镇", "企石镇", "横沥镇", "桥头镇", "谢岗镇", "东坑镇", "常平镇", "寮步镇", "大朗镇", "黄江镇", "清溪镇", "塘厦镇", "凤岗镇", "长安镇", "虎门镇", "厚街镇", "沙田镇", "道滘镇", "洪梅镇", "麻涌镇", "中堂镇", "高埗镇", "樟木头镇", "大岭山镇", "望牛墩镇", "东城街道", "万江街道", " 莞城街道", "南城街道"]);
dsy.add("0_4_4",["禅城区","南海区","顺德区","三水区","高明区"]);
dsy.add("0_4_5",["东源县","和平县","源城区","连平县","龙川县","紫金县"]);
dsy.add("0_4_6",["博罗县","惠东县","惠阳区","惠城区","龙门县"]);
dsy.add("0_4_7",["恩平市","鹤山市","新会区","开平市","台山市","蓬江区","江海区"]);
dsy.add("0_4_8",["惠来县","揭东区","揭西县","榕城区","普宁市"]);
dsy.add("0_4_9",["电白区","高州市","化州市","信宜市","茂南区"]);
dsy.add("0_4_10",["大埔县","丰顺县","蕉岭县","梅县区","梅江区","平远县","五华县","兴宁市"]);
dsy.add("0_4_11",["佛冈县","连南瑶族自治县","连山壮族瑶族自治县","连州市","清新区","清城区","阳山县","英德市"]);
dsy.add("0_4_12",["潮阳区","澄海区","南澳县","潮南区","濠江区","金平区","龙湖区"]);
dsy.add("0_4_13",["海丰县","陆丰市","陆河县","城区"]);
dsy.add("0_4_14",["乐昌市","南雄市","曲江区","仁化县","乳源瑶族自治县","浈江区","始兴县","翁源县","新丰县","武江区"]);
dsy.add("0_4_15",["阳春市","阳东区","江城区","阳西县"]);
dsy.add("0_4_16",["罗定市","新兴县","郁南县","云安区","云城区"]);
dsy.add("0_4_17",["雷州市","廉江市","遂溪县","吴川市","徐闻县","麻章区","坡头区","霞山区","赤坎区"]);
dsy.add("0_4_18",["德庆县","封开县","高要市","广宁县","怀集县","四会市","鼎湖区","端州区"]);
dsy.add("0_4_19", ["黄圃镇", "南头镇", "东凤镇", "阜沙镇", "小榄镇", "东升镇", "古镇镇", "横栏镇", "三角镇", "民众镇", "南朗镇", "港口镇", "大涌镇", "沙溪镇", "三乡镇", "板芙镇", "神湾镇", "坦洲镇", "石岐街道", "西区街道", "东区街道", "南区街道", "火炬街道", "五桂山街道"]);

dsy.add("0_4_20", ["香洲区", "斗门区", "金湾区"]);

dsy.add("0_5", ["南宁", "百色", "北海", "崇左", "防城港", "桂林", "贵港", "河池", "贺州", "来宾", "柳州", "钦州", "梧州", "玉林"]);
dsy.add("0_5_0", ["青秀区", "兴宁区", "西乡塘区", "江南区", "良庆区", "邕宁县", "宾阳县", "横县", "隆安县", "马山县", "上林县", "武鸣县"]);
dsy.add("0_5_0_0", ["长湖路", "长塘镇", "东盟商务区", "东葛路", "凤岭北", "古城建政区", "会展中心", "建政", "津头", "柳沙片区", "伶俐镇", "民族广场", "南湖广场", "南湖", "青秀山", "七星桃源区", "望园路", "五象广场", "仙葫经济开发区", "新竹", "云景路", "中山", "其他"]);
dsy.add("0_5_0_1", ["安宁", "朝阳", "东沟岭", "昆仑", "民生", "三塘", "望州岭", "五塘", "兴宁区政府", "其他"]);
dsy.add("0_5_0_2", ["安吉大道", "安吉", "安宁", "北湖路", "北大路", "北湖", "大学东路", "高新开发区", "衡阳路", "衡阳", "华强", "金陵镇", "科园大道", "鲁班路", "明秀路", "上尧", "石埠", "双定镇", "坛洛镇", "相思湖新区", "新阳路", "秀厢大道", "西乡塘", "新阳", "心圩", "其他"]);
dsy.add("0_5_0_3", ["白沙大道", "福建园", "国家经济开发区", "江南", "江西", "那洪", "沙井大道", "沙井", "苏圩", "五一路", "吴圩", "星光大道", "延安", "壮锦大道", "其他"]);
dsy.add("0_5_0_4", ["大沙田", "大塘", "良庆", "那马", "南晓", "那陈", "五象大道", "沿海经济开发区", "其他"]);
dsy.add("0_5_0_5", ["百济", "彩虹路", "良庆", "那楼", "蒲庙", "新兴广场", "新江", "银峰路", "中和", "其他"]);
dsy.add("0_5_0_6", ["其他"]);
dsy.add("0_5_0_7", ["其他"]);
dsy.add("0_5_0_8", ["其他"]);
dsy.add("0_5_0_9", ["其他"]);
dsy.add("0_5_0_10", ["其他"]);
dsy.add("0_5_0_11", ["其他"]);
dsy.add("0_5_1",["右江区","德保县","靖西县","乐业县","凌云县","隆林各族自治县","那坡县","平果县","田东县","田林县","田阳县","西林县"]);
dsy.add("0_5_2",["铁山港区","合浦县","银海区","海城区"]);
dsy.add("0_5_3",["江州区","大新县","扶绥县","龙州县","宁明县","凭祥市","天等县"]);
dsy.add("0_5_4",["东兴市","港口区","上思县","防城区"]);
dsy.add("0_5_5",["恭城瑶族自治县","灌阳县","秀峰区","荔浦县","临桂区","灵川县","龙胜各族自治县","平乐县","全州县","兴安县","阳朔县","永福县","资源县","叠彩区","象山区","七星区","雁山区"]);
dsy.add("0_5_6",["桂平市","港北区","平南县","港南区","覃塘区"]);
dsy.add("0_5_7",["巴马瑶族自治县","大化瑶族自治县","东兰县","都安瑶族自治县","凤山县","金城江区","环江毛南族自治县","罗城仫佬族自治县","南丹县","天峨县","宜州市"]);
dsy.add("0_5_8",["富川瑶族自治县","八步区","昭平县","钟山县"]);
dsy.add("0_5_9",["合山市","金秀瑶族自治县","兴宾区","武宣县","象州县","忻城县"]);
dsy.add("0_5_10",["柳城县","柳江县","城中区","鹿寨县","融安县","融水苗族自治县","三江侗族自治县","鱼峰区","柳南区","柳北区"]);
dsy.add("0_5_11",["灵山县","浦北县","钦南区","钦北区"]);
dsy.add("0_5_12",["苍梧县","蒙山县","藤县","万秀区","岑溪市","龙圩区","长洲区"]);
dsy.add("0_5_13",["北流市","博白县","陆川县","容县","兴业县","玉州区"]);

dsy.add("0_6", ["贵阳", "安顺", "毕节", "六盘水", "黔东南苗族侗族自治州", "黔南布依族苗族自治州", "黔西南布依族苗族自治州", "铜仁", "遵义"]);
dsy.add("0_6_0", ["南明区", "云岩区", "小河区", "花溪区", "乌当区", "白云区", "金阳新区", "小河片", "清镇市", "修文县", "息烽县", "开阳县","观山湖区"]);
dsy.add("0_6_0_0", ["次南门", "大南门", "都司路", "东门", "二戈寨", "甘荫塘", "何斌", "花果园", "花果园大街", "火车站", "甲秀楼", "纪念塔", "龙洞堡", "蟠桃宫", "市政府", "水口寺", "市南路", "省军区", "太慈桥", "新华路", "西湖路", "兴关", "油榨路", "中华南路", "中曹", "遵义路", "砖石广场", "其他"]);
dsy.add("0_6_0_1", ["北京路", "八鸽岩", "大营坡", "东山", "大十字", "贵乌璐", "环城北路", "海马冲", "金顶山", "蛮坡", "普陀路", "喷水池", "黔灵东路", "黔灵公园", "瑞金北路", "市西路", "三桥", "师大", "市北路", "头桥", "威清路", "未来方舟", "文昌北路", "文昌南路", "小十字", "新添大道南段", "延安中路", "延安西路", "月亮岩", "中华北路", "中华西路", "中华东路", "宅吉", "枣山路", "紫林庵", "其他"]);
dsy.add("0_6_0_2", ["长江路", "贵行华阳", "黄河路", "华阳厂", "金竹", "浦江广场", "浦江路", "四方河", "小河", "小河转盘", "小河平桥", "兴隆花园", "中兴世家", "珠江路", "其他"]);
dsy.add("0_6_0_3", ["花溪", "花溪公园", "花溪大学城", "金竹", "农园", "青园", "清溪路", "石板", "学士路", "徐家冲", "其他"]);
dsy.add("0_6_0_4", ["保利公园", "保利温泉", "东凤", "金华", "水田", "水景花都", "温泉路", "新添寨", "羊昌", "朱昌", "振华广场", "117地质队", "501厂", "其他"]);
dsy.add("0_6_0_5", ["白云公园", "步行街", "白云铁桥", "大山洞", "都拉营", "龚家寨", "南湖新区", "同心路", "艳山红", "其他"]);
dsy.add("0_6_0_6", ["碧海花园", "八匹马", "观山湖", "会展城", "会展中心", "金阳客车站", "金阳医院", "金珠路", "科技园", "世纪城", "云峰大道", "其他"]);
dsy.add("0_6_0_7", ["其他"]);
dsy.add("0_6_0_8", ["北门桥", "东门桥", "大转盘", "红枫湖", "九华", "青龙", "三角花园", "卫城", "新店", "云岭", "站街", "其他"]);
dsy.add("0_6_0_9", ["城关", "久长", "六厂", "扎佐", "其他"]);
dsy.add("0_6_0_10", ["九庄", "温泉", "小寨坝", "永靖", "其他"]);
dsy.add("0_6_0_11", ["城关", "冯三", "金中", "龙岗", "马场", "双流", "其他"]);
dsy.add("0_6_0_12", ["其他"]);


dsy.add("0_6_1",["西秀区","关岭布依族苗族自治县","平坝区","普定县","镇宁布依族苗族自治县","紫云苗族布依族自治县"]);
dsy.add("0_6_2",["七星关区","大方县","赫章县","金沙县","纳雍县","黔西县","威宁彝族回族苗族自治县","织金县"]);
dsy.add("0_6_3",["钟山区","六枝特区","盘县","水城县"]);
dsy.add("0_6_4",["从江县","丹寨县","黄平县","剑河县","锦屏县","凯里市","雷山县","黎平县","麻江县","三穗县","施秉县","台江县","天柱县","镇远县","岑巩县","榕江县"]);
dsy.add("0_6_5",["长顺县","都匀市","独山县","福泉市","贵定县","惠水县","荔波县","龙里县","罗甸县","平塘县","三都水族自治县","瓮安县"]);
dsy.add("0_6_6",["安龙县","册亨县","普安县","晴隆县","望谟县","兴仁县","兴义市","贞丰县"]);
dsy.add("0_6_7",["德江县","江口县","石阡县","思南县","松桃苗族自治县","碧江区","万山区","沿河土家族自治县","印江土家族苗族自治县","玉屏侗族自治县"]);
dsy.add("0_6_8",["赤水市","道真仡佬族苗族自治县","凤冈县","仁怀市","绥阳县","桐梓县","务川仡佬族苗族自治县","习水县","余庆县","正安县","红花岗区","遵义县","湄潭县","汇川区"]);

dsy.add("0_7", ["海口", "白沙黎族自治县", "保亭黎族苗族自治县", "昌江黎族自治县", "澄迈县", "定安县", "东方", "乐东黎族自治县", "临高县", "陵水黎族自治县", "琼海", "琼中黎族苗族自治县", "三亚", "屯昌县", "万宁", "文昌", "五指山", "儋州"]);
dsy.add("0_7_0", ["龙华区", "美兰区", "秀英区", "琼山区"]);
dsy.add("0_7_0_0", ["滨海", "大同", "海垦", "金贸", "金宇", "中山", "其他"]);
dsy.add("0_7_0_1", ["博爱", "白龙", "白沙", "海府", "海甸", "和平南", "蓝天", "人民路", "其他"]);
dsy.add("0_7_0_2", ["海秀", "秀英", "其他"]);
dsy.add("0_7_0_3", ["大坡", "府城", "国兴", "红旗", "甲子", "旧州", "龙塘", "三门坡", "云龙", "其他"]);

dsy.add("0_7_1", ["白沙黎族自治县"]);
dsy.add("0_7_2",["保亭黎族苗族自治县"]);
dsy.add("0_7_3",["昌江黎族自治县"]);
dsy.add("0_7_4",["澄迈县"]);
dsy.add("0_7_5",["定安县"]);
dsy.add("0_7_6",["东方市"]);
dsy.add("0_7_7",["乐东黎族自治县"]);
dsy.add("0_7_8",["临高县"]);
dsy.add("0_7_9",["陵水黎族自治县"]);
dsy.add("0_7_10",["琼海市"]);
dsy.add("0_7_11",["琼中黎族苗族自治县"]);
dsy.add("0_7_12",["海棠区","吉阳区","天涯区","崖州区"]);
dsy.add("0_7_13",["屯昌县"]);
dsy.add("0_7_14",["万宁市"]);
dsy.add("0_7_15",["文昌市"]);
dsy.add("0_7_16",["五指山市"]);
dsy.add("0_7_17",["儋州市"]);

dsy.add("0_8", ["石家庄", "保定", "沧州", "承德", "邯郸", "衡水", "廊坊", "秦皇岛", "唐山", "邢台", "张家口"]);
dsy.add("0_8_0", ["长安区", "桥东区", "桥西区", "新华区", "井陉矿区", "高邑县", "晋州市", "井陉县", "灵寿县", "鹿泉市", "平山县", "深泽县", "无极县", "辛集市", "新乐市", "行唐县", "元氏县", "赞皇县", "赵县", "正定县", "藁城市", "栾城县","裕华区", "郊区"]);
dsy.add("0_8_0_0", ["白佛", "长丰", "翟营", "丰收路", "广安", "高营", "光华路", "河东", "和平东路", "建北", "建华", "建明", "南村", "青园", "省博物馆", "谈固", "体育北大街", "土贤庄", "西兆通", "育才", "跃进路", "沿东", "中山东路", "其他"]);
dsy.add("0_8_0_1", ["长征街", "大经街", "东凤", "东平路", "阜康", "和平东路", "槐中路", "汇通路", "建安", "佳农市场", "建设北大街", "建设南大街", "彭后", "平安公园", "平安大街", "平安南大街", "桥东区政府", "胜南", "胜北", "石纺路", "四中路", "桃园", "休门", "义堂", "中山东路", "其他"]);
dsy.add("0_8_0_2", ["北杜", "滨河", "城角", "东里", "东五里", "工农路", "红旗", "槐安路", "槐西", "火车站", "建国路", "留营", "南长", "师范街", "石铜路", "唯明", "新石", "西里", "西三教", "新华南路", "友谊", "苑东", "裕西", "玉村", "中山", "振头", "中华南大街", "自强路", "其他"]);
dsy.add("0_8_0_3", ["北苑", "柏林", "北荣街", "北新街", "东焦", "大郭", "杜北", "电大街", "二中", "革新", "高柱", "合作路", "红星街", "红军大街", "和平西路", "联盟", "宁安", "石岗", "水上公园", "天苑", "泰华街", "五七", "新华街", "西苑", "西三庄", "西焦", "兴凯路", "友谊街口", "赵陵铺", "其他"]);
dsy.add("0_8_0_4", ["风山", "横涧", "贾庄", "矿市", "四微", "其他"]);
dsy.add("0_8_0_5", ["其他"]);
dsy.add("0_8_0_6", ["其他"]);
dsy.add("0_8_0_7", ["其他"]);
dsy.add("0_8_0_8", ["其他"]);
dsy.add("0_8_0_9", ["其他"]);
dsy.add("0_8_0_10", ["其他"])
dsy.add("0_8_0_11", ["其他"]);
dsy.add("0_8_0_12", ["其他"]);
dsy.add("0_8_0_13", ["其他"]);
dsy.add("0_8_0_14", ["其他"]);
dsy.add("0_8_0_15", ["其他"]);
dsy.add("0_8_0_16", ["其他"])
dsy.add("0_8_0_17", ["其他"]);
dsy.add("0_8_0_18", ["其他"]);
dsy.add("0_8_0_19", ["其他"]);
dsy.add("0_8_0_20", ["其他"]);
dsy.add("0_8_0_21", ["其他"]);
dsy.add("0_8_0_22", ["其他"]);
dsy.add("0_8_0_23", ["其他"]);

dsy.add("0_8_1",["新市区","北市区","南市区","满城县","清苑县","涞水县","阜平县","徐水县","定兴县","唐县","高阳县","容城县","涞源县","望都县","安新县","易县","曲阳县","蠡县","顺平县","博野县","雄县","涿州市","定州市","安国市","高碑店市"]);
dsy.add("0_8_2",["新华区","运河区","沧县","青县","东光县","海兴县","盐山县","肃宁县","南皮县","吴桥县","献县","孟村回族自治县","泊头市","任丘市","黄骅市","河间市"]);
dsy.add("0_8_3",["双桥区","双滦区","鹰手营子矿区","承德县","兴隆县","平泉县","滦平县","隆化县","丰宁满族自治县","宽城满族自治县","围场满族蒙古族自治县"]);
dsy.add("0_8_4",["邯山区","丛台区","复兴区","峰峰矿区","邯郸县","临漳县","成安县","大名县","涉县","磁县","肥乡县","永年县","邱县","鸡泽县","广平县","馆陶县","魏县","曲周县","武安市"]);
dsy.add("0_8_5",["桃城区","枣强县","武邑县","武强县","饶阳县","安平县","故城县","景县","阜城县","冀州市","深州市"]);
dsy.add("0_8_6",["安次区","广阳区","固安县","永清县","香河县","大城县","文安县","大厂回族自治县","霸州市","三河市"]);
dsy.add("0_8_7",["昌黎县","抚宁县","卢龙县","青龙满族自治县","海港区","山海关区","北戴河区"]);
dsy.add("0_8_8",["乐亭县","滦南县","滦县","迁安市","迁西县","唐海县","玉田县","遵化市","路南区","路北区","古冶区","开平区","新区","丰润区","丰南区","曹妃甸区"]);
dsy.add("0_8_9",["柏乡县","广宗县","巨鹿县","临城县","临西县","隆尧县","南宫市","南和县","内丘县","宁晋县","平乡县","清河县","任县","沙河市","威县","新河县","邢台县","桥东区","桥西区"]);
dsy.add("0_8_10",["赤城县","崇礼县","沽源县","怀安县","怀来县","康保县","尚义县","万全县","蔚县","宣化县","阳原县","张北县","涿鹿县","桥东区","桥西区","宣化区","下花园区"]);



dsy.add("0_9", ["郑州", "安阳", "鹤壁", "济源", "焦作", "开封", "洛阳", "南阳", "平顶山", "三门峡", "商丘", "新乡", "信阳", "许昌", "周口", "驻马店", "漯河", "濮阳"]);
dsy.add("0_9_0", ["中原区", "二七区 ", "管城回族区", "金水区", "上街区", "惠济区", "登封市", "巩义市", "新密市", "新郑市", "中牟县", "荥阳市","郑东新区"]);
dsy.add("0_9_0_0", ["碧沙岗", "帝湖", "冯庄", "华山路", "淮河西路", "航海西路", "建设路", "凯旋门", "绿东村", "林山寨", "陇海西路", "棉纺路", "秦岭路", "齐礼阎", "汝河路", "三官庙", "石佛镇", "柿园", "嵩山北路", "桐柏路", "文化宫路", "五龙口", "西站", "燕庄", "伊河路", "周新庄", "中原西路", "其他"]);
dsy.add("0_9_0_1", ["长江路", "大学路", "德化街", "二七广场", "福华街", "淮河路", "火车站", "解放路", "建中街", "京广路", "老代庄", "铭功路", "蜜蜂张", "庆丰街", "汝河西路", "冉屯路", "嵩山路", "五里堡", "一马路", "医学院", "其他"]);
dsy.add("0_9_0_2", ["北下街", "城东路", "东开发区", "东大街", "东明路南段", "东太康路", "东站片", "二里岗", "管城区委", "管南片", "花园路", "航海东路", "经八路", "陇海马路", "陇海东路", "南关", "商城路", "商代遗址", "西大街", "郑汴路", "紫荆山路", "其他"]);
dsy.add("0_9_0_3", ["北林路", "北环", "北站", "陈寨", "杜岭", "大石桥", "大铺", "东风路", "东明路", "东三街", "丰产路", "丰庆路", "国基路", "花园路", "海滩街", "黄河路", "经八路", "金水路", "经三路", "经五路", "孟寨", "南阳路", "南阳新村", "农业路", "人民路", "沙口路", "沙门", "索凌路", "文化路", "未来路", "卫生路", "新柳路", "徐寨", "姚寨", "玉凤路", "中方园", "其他"]);
dsy.add("0_9_0_4", ["济源路", "矿山", "聂寨", "新安西路", "其他"]);
dsy.add("0_9_0_5", ["北大学城", "长兴路", "大河路", "江山路", "开元路", "老鸦陈", "刘寨", "天河路", "新城", "迎宾路", "岳寨", "英才街", "其他"]);
dsy.add("0_9_0_6", ["其他"]);
dsy.add("0_9_0_7", ["其他"]);
dsy.add("0_9_0_8", ["其他"]);
dsy.add("0_9_0_9", ["其他"]);
dsy.add("0_9_0_10", ["其他"]);
dsy.add("0_9_0_11", ["其他"]);
dsy.add("0_9_0_12", ["其他"]);

dsy.add("0_9_1", ["文峰区", "北关区", "殷都区", "龙安区", "安阳县", "滑县", "林州市", "内黄县", "汤阴县"]);
dsy.add("0_9_2",["鹤山区","山城区","淇滨区","浚县","淇县"]);
dsy.add("0_9_3",["济源市"]);
dsy.add("0_9_4",["博爱县","解放区","中站区","马村区","山阳区","孟州市","沁阳市","温县","武陟县","修武县"]);
dsy.add("0_9_5",["龙亭区","顺河回族区","鼓楼区","禹王台区","祥符区","兰考县","通许县","尉氏县","杞县"]);
dsy.add("0_9_6",["洛宁县","老城区","西工区","廛河回族区","涧西区","吉利区","洛龙区","孟津县","汝阳县","新安县","伊川县","宜阳县","偃师市","嵩县","栾川县"]);
dsy.add("0_9_7",["邓州市","方城县","宛城区","卧龙区","南召县","内乡县","社旗县","唐河县","桐柏县","西峡县","新野县","镇平县","淅川县"]);
dsy.add("0_9_8",["宝丰县","鲁山县","新华区","卫东区","石龙区","湛河区","汝州市","舞钢市","叶县","郏县"]);
dsy.add("0_9_9",["灵宝市","卢氏县","湖滨区","陕县","义马市","渑池县"]);
dsy.add("0_9_10",["民权县","宁陵县","梁园区","睢阳区","夏邑县","永城市","虞城县","柘城县","睢县"]);
dsy.add("0_9_11",["长垣县","封丘县","辉县市","获嘉县","卫辉市","红旗区","卫滨区","凤泉区","牧野区","新乡县","延津县","原阳县"]);
dsy.add("0_9_12",["固始县","光山县","淮滨县","罗山县","商城县","息县","新县","浉河区","潢川县","平桥区"]);
dsy.add("0_9_13",["长葛市","襄城县","魏都区","许昌县","禹州市","鄢陵县"]);
dsy.add("0_9_14",["郸城县","扶沟县","淮阳县","鹿邑县","商水县","沈丘县","太康县","西华县","项城市","川汇区"]);
dsy.add("0_9_15",["泌阳县","平舆县","确山县","汝南县","上蔡县","遂平县","西平县","新蔡县","正阳县","驿城区"]);
dsy.add("0_9_16",["临颍县","舞阳县","郾城区","源汇区","召陵区"]);
dsy.add("0_9_17",["范县","南乐县","清丰县","台前县","华龙区","濮阳县"]);

dsy.add("0_10", ["哈尔滨", "大庆", "大兴安岭", "鹤岗", "黑河", "鸡西", "佳木斯", "牡丹江", "七台河", "齐齐哈尔", "双鸭山", "绥化", "伊春"]);
dsy.add("0_10_0", ["南岗区", "道里区", "道外区", "香坊区", "江北区", "开发区", "平房区", "阿城区", "巴彦县", "宾县", "方正县", "呼兰区", "木兰县", "尚志市", "双城市", "通河县", "五常市", "延寿县", "依兰县"]);
dsy.add("0_10_0_0", ["博物馆", "保健路", "比乐街", "巴陵街", "船舶", "长江路", "大成", "东大直街", "鼎新三道街", "大众新城", "儿童公园", "奋斗", "复华小区", "分部街", "复旦街", "国展", "果戈里", "革新", "工人文化宫", "公司街", "光芒街", "哈西", "和兴路", "哈站", "花园", "黄河路", "红旗大街", "会展中心", "汉水路", "鸿翔路", "哈达", "红旗", "黑大", "和兴三道街", "汉广街", "海城街", "哈工大", "海河路", "哈尔滨游乐园", "黑山街", "河沟街", "哈平路", "教化", "极乐寺", "军工", "教化街", "新建街", "洁净街", "宽城街", "科大小区", "芦家街", "辽阳街", "燎原街", "联部街", "闽江", "马端街", "木兰街", "满洲里街", "南通大街", "平淮街", "秋林", "千山路", "清滨路", "清明四道街", "七政街", "人和名苑", "省政府", "十字街", "省人才", "嵩山路", "省人大", "上夹树街", "松花江街", "三性街", "通达街", "铁路街", "泰海花园", "文昌街", "文兴街", "文府街", "文君街", "文成街", "文化街", "文明街", "文景街", "文林街", "学府", "西大直街", "宣化", "先锋路", "宣庆", "新春", "学府四道街", "信恒现代城", "一曼街", "医大一院", "烟厂", "医大二院", "一匡街", "延兴路", "邮政街", "延平街", "阳光绿色家园", "伊春路", "中山路", "征仪路", "中兴街", "中兴大道", "其他"]);
dsy.add("0_10_0_1", ["安国路", "爱建", "埃德蒙顿路", "安红街", "安广街", "安升街", "爱建路", "安阳街", "安发街", "安隆街", "安化街", "安松街", "安宁街", "安康街", "百盛", "城乡路", "地段路", "大发", "大安街", "东站街", "东湖路", "滇池路", "抚顺", "防洪纪念塔", "工程街", "公路大桥", "顾乡", "工部街", "光义街", "哈药街", "河松", "红霞街", "河柏街", "河政街", "河洲街", "河山街", "河鼓街", "河清街", "河润街", "河阳街", "哈双北路", "恒祥城", "经纬街", "建国街", "建国公园", "机场路", "建议街", "霁虹街", "金江路", "康安路", "昆仑路", "昆仑街", "灵江街", "丽江街", "郎江街", "买卖街", "民兴街", "民生街", "民众街", "民安街", "南湖路", "群力", "前进路", "秦岭柳", "青山路", "融江路", "尚志大街", "索菲亚教堂", "市委", "上海街", "松源街", "田地街", "通江", "透笼", "通达街", "天平路", "新阳路", "乡镇街", "友谊路", "一面街", "燕山路", "中央大街", "兆麟街", "中医街", "其他"]);
dsy.add("0_10_0_2", ["安华街", "滨江", "北环商城", "北十四道街", "保障街", "北宣桥街", "北五道街", "北园街", "北树小区", "滨河新城", "八区", "承德广场", "承德街", "大方里", "大新", "大新街", "大方里街", "东菜街", "东北新街", "道外区政府", "东直路", "道口头道街", "大有坊街", "东棵街", "东科小区", "东方红小区", "二十一道街", "丰润街", "富达蓝山", "港务局", "橄榄城", "更新街", "公益街", "古梨园", "宏伟路", "红旗小区", "红旗大街", "哈东站", "和平小区", "海员街", "桦树街", "哈东路", "宏伟小区", "淮河路", "宏图街", "宏南街", "化工路", "航运小区", "靖宇", "景阳街", "极乐街", "江畔街", "开原街", "黎华小区", "辽河小区", "礼化街", "路南街", "辽河路", "玛克威", "民强大街", "南直路", "南极市场", "南马路", "南极街", "南勋街", "南十四街道", "南十六道街", "南十八道街", "南新街", "南九道街", "南七道街", "南五道街", "南直小区", "南棵头道街", "南棵二道街", "男科四道街", "南棵五道街", "平湖街", "钱塘街", "仁里街", "三棵树", "十九道街", "水晶街", "水源街", "四海街", "太平桥", "太古", "太古长安城", "天木小区", "太安大街", "太平大街", "通港街", "太平公园", "天恒大街", "卫星路", "武源街", "新马路", "先锋小气", "新街道", "新江桥街", "禧龙", "鑫都嘉园", "药六", "宇轩", "迎新街", "延平街", "邮电街", "一机路", "药六嘉园", "中马路", "振江街", "其他"]);
dsy.add("0_10_0_3", ["安埠", "菜艺街", "果园", "赣水路", "公滨路", "工电路", "哈平路", "红旗大街", "和平路", "哈量", "哈慈", "进乡街", "建北", "劫源街", "昆仑商城", "乐松", "乐园街", "母亲广场", "民生路", "木材", "闽江路", "农大", "农林街", "三大动力", "三合路", "司徒街", "通乡商店", "通天", "天鹅饭店", "万达", "文政", "王兆", "文政街", "文昌街", "王兆街", "文治街", "文治二街道", "西香坊", "香坊大街", "幸福", "旭升街", "香江路", "香槟路", "珠江路", "其他"]);
dsy.add("0_10_0_4", ["柏林四季", "北京路", "对青山", "丁香大道", "江康路", "江安路", "利民开发区", "乐业", "利民大道", "龙兴路", "龙胜路", "龙翔路", "龙轩路", "龙川路", "南京路", "松北", "世茂大道", "松浦", "三电", "松北大道", "松浦大道", "松北区政府", "市政府", "世阳路", "世详路", "太阳岛", "万宝", "万宝大道", "学院路", "祥安北大街", "西宁路", "燕京路", "志华商城", "中源大道", "左岸大街", "其他"]);
dsy.add("0_10_0_5", ["龙塔", "省人才"]);
dsy.add("0_10_0_6", ["保国", "联盟", "平房镇", "平新", "新伟", "新疆", "新疆", "友协", "其他"]);

dsy.add("0_10_1",["萨尔图区","龙凤区","让胡路区","红岗区","大同区","杜尔伯特蒙古族自治县","林甸县","肇源县","肇州县"]);
dsy.add("0_10_2",["呼玛县","漠河县","塔河县"]);
dsy.add("0_10_3",["向阳区","工农区","南山区","兴安区","东山区","兴山区","萝北县","绥滨县"]);
dsy.add("0_10_4",["北安市","爱辉区","嫩江县","孙吴县","五大连池市","逊克县"]);
dsy.add("0_10_5",["虎林市","鸡东县","鸡冠区","恒山区","滴道区","梨树区","城子河区","麻山区","密山市"]);
dsy.add("0_10_6",["抚远县","富锦市","向阳区","前进区","东风区","郊区","汤原县","同江市","桦川县","桦南县"]);
dsy.add("0_10_7",["东宁县","海林市","林口县","东安区","阳明区","爱民区","西安区","穆棱市","宁安市","绥芬河市"]);
dsy.add("0_10_8",["勃利县","新兴区","桃山区","茄子河区",]);
dsy.add("0_10_9",["拜泉县","富裕县","甘南县","克东县","克山县","龙江县","龙沙区","建华区","铁锋区","昂昂溪区","富拉尔基区","碾子山区","梅里斯达斡尔族区","泰来县","依安县","讷河市"]);
dsy.add("0_10_10",["宝清县","集贤县","饶河县","尖山区","岭东区","四方台区","宝山区","友谊县"]);
dsy.add("0_10_11",["安达市","海伦市","兰西县","明水县","青冈县","庆安县","北林区","绥棱县","望奎县","肇东市"]);
dsy.add("0_10_12",["嘉荫县","铁力市","伊春区","南岔区","友好区","西林区","翠峦区","新青区","美溪区","金山屯区","五营区","乌马河区","汤旺河区","带岭区","乌伊岭区","红星区","上甘岭区"]);

dsy.add("0_11",["武汉","恩施土家族苗族自治州","黄冈","黄石","荆门","荆州","潜江","神农架林区","十堰","随州","天门","鄂州","仙桃","咸宁","襄阳","孝感","宜昌"]);
dsy.add("0_11_0", ["江汉区", "江岸区", "硚口区", "武昌区", "洪山区", "青山区", "汉阳区", "沌口开发区", "东西湖区", "蔡甸区", "黄陂区", "新洲区", "江夏区", "汉南区"]);
dsy.add("0_11_0_0", ["北湖", "常青", "红旗渠", "汉兴", "民意", "满春", "名族", "民权", "前进", "水塔", "唐家墩", "万松", "新华", "西北湖", "杨汊湖", "其他"]);
dsy.add("0_11_0_1", ["百步亭", "车站", "谌家矶", "大智街", "单池水", "岱山", "二七", "花桥", "后湖", "汉口火车站", "建设大道", "江汉路", "劳动", "球场街", "三阳路", "上海", "四唯", "台北路", "香港路", "西马", "新村", "永清", "一元路", "竹叶山", "其他"]);
dsy.add("0_11_0_2", ["宝丰", "崇仁", "古田", "汉正", "汉水街", "韩家墩", "六角亭", "荣华", "武胜路", "易家墩", "宗关", "其他"]);
dsy.add("0_11_0_3", ["白沙洲", "东亭", "丁字桥", "傅家坡", "黄鹤楼", "积玉桥", "珞珈山", "粮道街", "粮道", "南湖花园", "南湖", "水果湖", "司门口", "首义路", "石洞", "武昌火车站", "武泰闸", "徐家棚", "徐东", "小东门", "新河", "杨园", "中北路", "中南路", "中华路", "紫阳", "其他"]);
dsy.add("0_11_0_4", ["陈家湾", "关山", "光谷", "广埠屯", "葛化", "红旗", "花山", "街道口", "鲁巷", "珞南", "珞狮南路", "软件园", "卓刀泉", "张家湾", "左岭", "其他"]);
dsy.add("0_11_0_5", ["白玉山", "厂前", "钢花村", "钢都", "人工村", "工业大道", "红钢城", "和平大道", "建设二路", "建设七路", "青山", "武东", "新沟桥", "冶金", "友谊大道", "余家头", "冶金大道", "其他"]);
dsy.add("0_11_0_6", ["翠微", "郭茨口", "汉江二桥", "建桥", "琴断口", "七里庙", "晴川", "升官渡", "王家湾", "五里墩", "鹦鹉", "月湖", "钟家村", "洲头", "其他"]);
dsy.add("0_11_0_7", ["车城路", "郭徐岭广场", "金色港湾", "江汉大学", "千年美丽", "四新", "体育中心", "陶家岭"]);
dsy.add("0_11_0_8", ["柏泉", "常青花园", "慈惠墩", "长青", "东山", "荷包湖", "将军路", "金银湖", "泾河", "李家墩", "三店", "吴家山", "新沟", "辛安渡", "走马岭", "其他"]);
dsy.add("0_11_0_9", ["蔡甸", "大集", "奓山", "新天街", "永安", "张湾", "侏儒", "其他"]);
dsy.add("0_11_0_10", ["横店", "汉口北", "罗汉寺", "六指店", "盘龙城", "前川", "祁家湾", "滠口", "天河", "其他"]);
dsy.add("0_11_0_11", ["仓埠", "旧街", "李集", "潘塘", "潘塘", "三店", "双柳", "汪集", "阳逻", "邾城", "其他"]);
dsy.add("0_11_0_12", ["藏龙岛", "东湖高新", "金口", "流芳", "庙山", "乌龙泉", "银河湾", "纸坊", "郑店", "其他"]);
dsy.add("0_11_0_13", ["邓南", "纱帽", "其他"]);


dsy.add("0_11_1", ["巴东县", "恩施市", "鹤峰县", "建始县", "来凤县", "利川市", "咸丰县", "宣恩县"]);
dsy.add("0_11_2",["红安县","黄州区","黄梅县","罗田县","麻城市","团风县","武穴市","英山县","蕲春县","浠水县"]);
dsy.add("0_11_3",["大冶市","黄石港区","西塞山区","下陆区","铁山区","阳新县"]);
dsy.add("0_11_4",["东宝区","掇刀区","京山县","沙洋县","钟祥市"]);
dsy.add("0_11_5",["公安县","洪湖市","监利县","江陵县","沙市区","荆州区","石首市","松滋市"]);
dsy.add("0_11_6",["潜江市"]);
dsy.add("0_11_7",["神农架林区"]);
dsy.add("0_11_8",["丹江口市","房县","茅箭区","张湾区","郧西县","郧阳区","竹山县","竹溪县"]);
dsy.add("0_11_9",["广水市","随县","曾都区"]);
dsy.add("0_11_10",["天门市"]);
dsy.add("0_11_11",["梁子湖区","华容区","鄂城区"]);
dsy.add("0_11_12",["仙桃市"]);
dsy.add("0_11_13",["赤壁市","崇阳县","嘉鱼县","通城县","通山县","咸安区"]);
dsy.add("0_11_14",["保康县","谷城县","老河口市","南漳县","襄城区","樊城区","襄州区","宜城市","枣阳市"]);
dsy.add("0_11_15",["安陆市","大悟县","汉川市","孝昌县","孝南区","应城市","云梦县"]);
dsy.add("0_11_16",["长阳土家族自治县","当阳市","五峰土家族自治县","兴山县","西陵区","伍家岗区","点军区","猇亭区","夷陵区","宜都市","远安县","枝江市","秭归县"]);

dsy.add("0_12", ["长沙", "常德", "郴州", "衡阳", "怀化", "娄底", "邵阳", "湘潭", "湘西土家族苗族自治州", "益阳", "永州", "岳阳", "张家界", "株洲"]);
dsy.add("0_12_0", ["开福区", "岳麓区", "雨花区 ", "天心区", "芙蓉区", "长沙县", "宁乡县", "望城县", "浏阳市"]);
dsy.add("0_12_0_0", ["北站路", "北正街", "八一桥", "北辰三角洲", "蔡锷北路", "大王家巷", "动物园", "东风路", "德雅路口", "德雅路", "德雅村", "东风村", "广电中心", "国防科大", "黑石渡", "洪山桥", "华夏路", "金霞路", "蒋家垅", "开福寺", "开福周边", "浏阳河", "丽臣路", "烈士公园", "浏阳河路", "民主东街", "潘家坪", "培元桥", "清水塘", "上大垅", "四方坪", "三一大道", "丝茅冲", "省博物馆", "省展览馆", "松桂园", "通泰街", "望麓园", "伍家岭", "王家垅", "王家巷", "新河", "西长街", "兴汉门", "湘雅医院", "湘雅路", "下大垅", "湘江中路", "湘江世纪城", "营盘路", "砚瓦池", "中山亭", "竹山园", "其他"]);
dsy.add("0_12_0_1", ["大学城", "枫林路", "观沙岭", "高叶塘", "湖南商学院", "湖南财专", "含浦", "桔子洲", "金星大道", "建鸿达现代公寓", "科教新村", "六沟垅", "雷锋大道", "麓山名园", "麓谷", "麓谷雅园", "麓谷沐春园", "牌楼路", "汽车西站", "省人防办", "市政府", "天马山", "桐梓坡", "桐梓坡路", "望月湖", "望城坡", "望岳", "魏家坡", "西湖", "咸嘉湖", "新民路", "咸嘉新村", "湘雅三医院", "西城龙庭", "岳麓", "银盆岭", "岳麓山", "溁湾镇", "岳麓周边", "左家垅", "其他"]);
dsy.add("0_12_0_2", ["阿弥岭", "茶园坡", "长岭", "赤岗岭", "长沙卷烟厂", "东塘", "洞井铺", "圭塘", "高桥", "桂花路口", "桂花公园", "公交新村", "侯家塘", "荷叶塘", "红星村", "红旗药号", "井湾子", "桔园小区", "劳动中路", "劳动西路", "麻园塘", "汽车南站", "七里庙", "砂子塘", "曙光路", "韶山中路", "韶山南路", "水风井", "曙光中路", "树木岭", "狮子山", "上海城", "铁道学院", "体育新城", "王家冲", "新中路立交桥", "新星小区", "香樟路", "喜盈门范城", "雨花亭", "雨花区政府", "雅塘村", "雨花周边", "窑岭", "左家塘", "梓园路口", "梓园路", "其他"]);
dsy.add("0_12_0_3", ["白沙街", "碧湘街", "白沙路", "城南路", "长沙理工大学", "东瓜山/赤岭路", "第一师范", "大椿桥", "芙蓉南路", "桂花坪", "高升小区", "广厦新村", "柑子园", "黄土岭", "猴子石", "侯家塘", "金盆岭", "解放西路", "解放四村", "劳动广场", "林科大", "林校", "南湖路", "南郊公园", "南门口", "坡子街", "浦沅", "青园", "书院路", "曙光路口", "石子冲", "省政府", "上海城", "涂家冲", "天心阁", "天心区政府", "天心周边", "天虹商场", "五凌电力", "学院街", "新开铺", "新姚路口", "裕南街", "雅礼中学", "仰天湖", "友谊路", "其他"]);
dsy.add("0_12_0_4", ["八一路", "朝阳街", "陈家湖", "赤岭路", "车站北路", "朝阳路", "蔡锷南路口", "蔡锷南路", "都正街", "东屯渡", "地质中学", "德政园", "定王台", "府后街", "芙蓉广场", "芙蓉苑", "芙蓉北路", "芙蓉区政府", "芙蓉中路", "芙蓉周边", "桂花村", "广济桥", "火星", "荷花园", "火炬村", "荷花路", "黄兴路", "火车站", "华海3c电脑城", "韭菜园", "解放路", "解放东路", "解放中路", "锦泰广场", "浏正街", "凌霄路", "浏城桥", "马王堆", "梦泽园", "农科院", "汽车东站", "人民中路", "人民路立交桥", "人民东路", "识字岭", "司门口", "松桂园", "省军区", "三湘大市场", "韶山北路", "文艺路", "五里牌", "万家丽", "五一大道", "五一广场", "晚报大道", "小林子冲", "湘湖路", "袁家岭", "杨家山", "中山路", "张公岭", "其他"]);
dsy.add("0_12_0_5", ["其他"]);
dsy.add("0_12_0_6", ["其他"]);
dsy.add("0_12_0_7", ["其他"]);
dsy.add("0_12_0_8", ["其他"]);

dsy.add("0_12_1", ["安乡县", "武陵区", "鼎城区", "汉寿县", "津市市", "临澧县", "石门县", "桃源县", "澧县"]);
dsy.add("0_12_2",["安仁县","北湖区","苏仙区","桂东县","桂阳县","嘉禾县","临武县","汝城县","宜章县","永兴县","资兴市"]);
dsy.add("0_12_3",["常宁市","衡东县","衡南县","衡山县","珠晖区","雁峰区","石鼓区","蒸湘区","南岳区","衡阳县","祁东县","耒阳市"]);
dsy.add("0_12_4",["辰溪县","洪江市","鹤城区","会同县","靖州苗族侗族自治县","麻阳苗族自治县","通道侗族自治县","新晃侗族自治县","中方县","芷江侗族自治县","沅陵县","溆浦县"]);
dsy.add("0_12_5",["冷水江市","涟源市","娄星区","双峰县","新化县"]);
dsy.add("0_12_6",["城步苗族自治县","洞口县","隆回县","邵东县","双清区","北塔区","大祥区","邵阳县","绥宁县","武冈市","新宁县","新邵县"]);
dsy.add("0_12_7",["韶山市","湘岳塘区","雨湖区","湘潭县","湘乡市"]);
dsy.add("0_12_8",["保靖县","凤凰县","古丈县","花垣县","吉首市","龙山县","永顺县","泸溪县"]);
dsy.add("0_12_9",["安化县","南县","桃江县","资阳区","赫山区","沅江市"]);
dsy.add("0_12_10",["道县","东安县","江华瑶族自治县","江永县","蓝山县","宁远县","祁阳县","双牌县","新田县","零陵区","冷水滩区"]);
dsy.add("0_12_11",["华容县","临湘市","平江县","湘阴县","岳阳楼区","云溪区","君山区","岳阳县","汨罗市"]);
dsy.add("0_12_12",["慈利县","桑植县","永定区","武陵源区"]);
dsy.add("0_12_13",["茶陵县","炎陵县","荷塘区","芦淞区","石峰区","天元区","株洲县","攸县","醴陵市"]);

dsy.add("0_13", ["长春", "白城", "白山", "吉林", "辽源", "四平", "松原", "通化", "延边朝鲜族自治州"]);
dsy.add("0_13_0", ["朝阳区", "南关区", "宽城区", "二道区", "绿园区", "高新技术开发区", "经济技术开发区", "净月旅游开发区", "德惠市", "九台区", "农安县", "榆树市","双阳区"]);
dsy.add("0_13_0_0", ["安达街", "白菊", "北安路", "长春理工大学", "长庆街", "长久路", "东北师大", "大兴路", "东朝阳路", "富锋", "繁荣路", "抚松路", "桂林路", "工农大路", "工学院", "红旗街", "湖西路", "辉南街", "湖光路", "建设路", "建设广场", "建工学院", "锦水路", "宽平大路", "开运路", "康平街", "宽平大桥", "孟家", "明水路", "南湖", "农大", "普庆路", "清和", "前进大街", "青华路", "人民广场西", "省实验", "同志街", "同光路", "泰来路", "同德路", "文化广场", "卫星广场", "万宝街", "西安大路", "西安大路", "西安华路", "西朝阳路", "西三道街", "新疆街", "翔运街", "新民广场", "永昌", "义和路", "延安大路", "重庆路", "中医学院", "其他"]);
dsy.add("0_13_0_1", ["长通路", "大马路", "大经路", "东岭南街", "东南湖大路", "东大桥", "动植物园", "东天街", "东岭街", "雕塑公园", "二马路", "鸿程", "珲春街", "净月镇", "解放大路", "净水路", "临河", "隆礼路", "民康路", "明珠", "南街", "南岭", "南关客运站", "磐石", "平阳街", "平治街", "全安", "清明街", "人民大街", "人民广场东", "曙光路", "四道街", "上海路", "树勋路", "三马路", "桃源", "通化路", "体育场", "卫星路", "文昌路", "新春", "西五", "西四街道", "幸福街", "永吉", "亚泰大街", "岳阳街", "自强街", "自由大路", "其他"]);
dsy.add("0_13_0_2", ["北亚泰大街", "农安南街", "群英", "胜利", "铁北", "天光路", "车轮厂", "菜市南街", "菜市北街", "东广场", "东安", "贵阳街", "光复路", "黑水路", "华正", "九台路", "凯旋路", "宽府路", "柳影路", "辽宁路", "南广场", "农安南街", "群英", "太阳城", "团山", "新法", "西广场", "兴业", "一匡街", "站前", "其他"]);
dsy.add("0_13_0_3", ["八里堡", "东盛", "东站", "东方广场", "和顺", "吉林", "荣光", "万通", "远达", "其他"]);
dsy.add("0_13_0_4", ["春城大街", "春草路", "创业大街", "东风大街", "二手房交易中心", "飞跃广场", "和平大街", "皓月大路", "弘海", "华港二手车交易中心", "锦程", "景阳广场", "基督街", "静安路", "客车厂", "辽阳街", "乐园路", "绿化街", "南阳路", "普阳街", "青年路", "青龙路", "升阳街", "铁西", "万福街", "西安广场", "西安桥", "西安桥外", "西新", "新竹", "西安大路", "翔运路", "西环城路", "延寿街", "阳光路", "正阳街", "中医院", "208医院", "其他"]);
dsy.add("0_13_0_5", ["光谷大道", "硅谷广场"]);
dsy.add("0_13_0_6", ["彩云街", "东广场", "会展大街", "临河街", "世纪大街", "世光路", "武汉路", "威海路", "洋浦大街", "中东大市场", "其他"]);
dsy.add("0_13_0_7", ["彩宇大街", "枫叶路", "净月大学城", "其他"]);
dsy.add("0_13_0_8", ["其他"]);
dsy.add("0_13_0_9", ["其他"]);
dsy.add("0_13_0_10", ["其他"]);
dsy.add("0_13_0_11", ["其他"]);
dsy.add("0_13_0_12", ["其他"]);

dsy.add("0_13_1",["洮北区","大安市","通榆县","镇赉县","洮南市"]);
dsy.add("0_13_2",["浑江区","江源区","长白朝鲜族自治县","抚松县","江源县","靖宇县","临江市"]);
dsy.add("0_13_3",["昌邑区","龙潭区","船营区","丰满区","磐石市","舒兰市","永吉县","桦甸市","蛟河市"]);
dsy.add("0_13_4",["东丰县","东辽县","龙山区","西安区"]);
dsy.add("0_13_5",["公主岭市","梨树县","双辽市","铁西区","铁东区","伊通满族自治县"]);
dsy.add("0_13_6",["长岭县","扶余市","乾安县","前郭尔罗斯蒙古族自治县","宁江区"]);
dsy.add("0_13_7",["辉南县","集安市","柳河县","梅河口市","东昌区","二道江区","通化县"]);
dsy.add("0_13_8",["安图县","敦化市","和龙市","龙井市","图们市","汪清县","延吉市","珲春市"]);

dsy.add("0_14", ["南京", "常州", "淮安市", "连云港", "南通", "苏州", "宿迁", "泰州", "无锡", "徐州", "盐城", "扬州", "镇江"]);

dsy.add("0_14_0", ["玄武区", "鼓楼区", "建邺区", "白下区", "秦淮区", "雨花台区", "江宁区", "栖霞区", "下关区", "浦口区", "六合区", "溧水区", "高淳区", "大厂区"]);
dsy.add("0_14_0_0", ["北京东路", "板仓", "长江路", "丹凤街", "后宰门", "红山", "兰园", "梅园", "锁金村", "卫岗", "新街口", "玄武门", "孝陵卫", "玄武湖", "月苑", "樱驼花园", "珠江路", "其他"]);
dsy.add("0_14_0_1", ["北京西路", "定淮门", "凤凰西街", "福建路", "广州路", "华侨路", "湖南路", "汉中门", "虎踞路", "江东", "龙江", "莫愁", "宁海路", "三牌楼", "水佐岗", "上海路", "许府巷", "挹江门", "中央门", "其他"]);
dsy.add("0_14_0_2", ["奥体", "滨湖", "白鹭花园", "茶南", "长虹路", "湖西街", "江心洲", "江东门", "南湖", "南苑", "沙洲", "双闸", "水西门", "兴隆", "应天西路", "其他"]);
dsy.add("0_14_0_3", ["朝天宫", "常府街", "长白街", "大光路", "大行宫", "光华路", "淮海路", "洪武路", "建康路", "苜蓿园", "瑞金路", "升州路", "太平南路", "五老村", "月牙湖", "御道街", "止马营", "中山门", "中山南路", "其他"]);
dsy.add("0_14_0_4", ["长乐路", "大明路", "夫子庙", "红花", "洪家园", "集庆门", "来凤", "秦虹", "双塘", "中华门", "其他"]);
dsy.add("0_14_0_5", ["安德门", "板桥", "梅山", "宁南", "能仁里", "赛虹桥", "铁心桥", "西善桥", "小行", "雨花新村", "其他"]);
dsy.add("0_14_0_6", ["百家湖", "滨江开发区", "淳华", "岔路口", "东山", "东善桥", "方山", "湖熟镇", "将军大道", "金箔路", "江宁镇", "九龙湖", "科学院", "开发区", "禄口", "秣陵", "麒麟门", "上坊", "上元大街", "胜太路", "双龙大道", "汤山", "天元东路", "陶吴镇", "文清路", "竹山路", "其他"]);
dsy.add("0_14_0_7", ["八卦洲", "靖安", "龙潭", "迈皋桥", "马群", "栖霞", "万寿", "仙林", "晓庄", "迈皋桥", "尧化", "燕子矶", "其他"]);
dsy.add("0_14_0_8", ["宝塔桥", "大桥南路", "建宁路", "金陵小区", "幕府山", "热河南路", "三汊河", "五塘", "小市", "阅江楼", "其他"]);
dsy.add("0_14_0_9", ["顶山", "高新区", "江浦", "南浦路", "盘城", "浦珠路", "桥北", "泰山", "沿江", "其他"]);
dsy.add("0_14_0_10", ["长芦", "葛塘", "龙池", "山潘", "西厂门", "卸甲甸", "雄州", "其他"]);
dsy.add("0_14_0_11", ["白马", "东屏", "洪蓝", "和凤", "晶桥", "溧水开发区", "溧水县农场", "石湫", "永阳", "柘塘", "其他"])
dsy.add("0_14_0_12", ["淳城", "淳溪", "东坝", "定埠", "古柏", "固城", "漆桥", "阳江", "桠溪", "砖墙", "其他"]);
dsy.add("0_14_0_13", ["其他"]);


dsy.add("0_14_1",["天宁区","钟楼区","戚墅堰区","新北区","金坛市","溧阳市","武进区"]);
dsy.add("0_14_2",["洪泽县","清河区","淮安区","清浦区","金湖县","涟水县","盱眙县","淮阴区"]);
dsy.add("0_14_3",["东海县","赣榆区","灌南县","灌云县","连云区","海州区","新浦区"]);
dsy.add("0_14_4",["海安县","海门市","港闸区","崇川区","启东市","如东县","如皋市","通州区"]);
dsy.add("0_14_5",["常熟市","昆山市","姑苏区","虎丘区","吴中区","太仓市","相城区","张家港市","吴江区"]);
dsy.add("0_14_6",["宿城区","宿豫区","沭阳县","泗洪县","泗阳县"]);
dsy.add("0_14_7",["姜堰区","靖江市","泰兴市","高港区","兴化市","海陵区"]);
dsy.add("0_14_8",["江阴市","崇安区","南长区","北塘区","滨湖区","惠山区","宜兴市","锡山区"]);
dsy.add("0_14_9",["丰县","沛县","铜山区","新沂市","鼓楼区","云龙区","贾汪区","泉山区","邳州市","睢宁县"]);
dsy.add("0_14_10",["滨海县","大丰市","东台市","阜宁县","建湖县","射阳县","响水县","亭湖区","盐都区"]);
dsy.add("0_14_11",["宝应县","高邮市","江都区","广陵区","仪征市","邗江区"]);
dsy.add("0_14_12",["丹阳市","句容市","扬中市","京口区","润州区","丹徒区"]);

dsy.add("0_15", ["南昌", "抚州", "赣州", "吉安", "景德镇", "九江", "萍乡", "上饶", "新余", "宜春", "鹰潭"]);
dsy.add("0_15_0", ["东湖区", "西湖区", "青云谱区", "青山湖区", "湾里区 ", "安义县", "进贤县", "南昌县", "新建县"]);
dsy.add("0_15_0_0", ["百花洲", "八一桥", "董家窑", "大院", "墩子塘", "叠山路", "二七北路", "公园", "民德路", "南京西路", "彭家桥", "青山南路", "沙井", "胜利路", "三经路", "苏圃路", "滕王阁", "象山北路", "豫章", "阳明东路", "阳明路", "其他"]);
dsy.add("0_15_0_1", ["北京西路", "朝阳洲", "船山路", "丁公路", "二七南路", "抚河", "广润门", "广场南路", "洪城路", "建设路", "老福山", "南站", "孺子路", "绳金塔", "十字街", "桃苑", "西湖", "系马桩", "象山南路", "贤士二路", "永叔路", "站前西路", "其他"]);
dsy.add("0_15_0_2", ["广州路", "洪都", "京山", "井冈山大道", "建设路", "解放西路", "南莲路", "三店西路", "象湖新城", "迎宾大道", "其他"]);
dsy.add("0_15_0_3", ["北京东路", "洪都北大道", "洪都中大道", "湖滨东路", "京东", "蛟桥", "江大南路", "解放东路", "罗家", "南京东路", "青山路", "青山湖大道", "上海路", "顺外路", "扬子洲", "其他"]);
dsy.add("0_15_0_4", ["罗亭", "梅岭", "太平", "幸福", "站前", "招贤", "其他"]);
dsy.add("0_15_0_5", ["长埠", "鼎湖", "东阳", "黄洲", "龙津", "石鼻", "万埠", "其他"]);
dsy.add("0_15_0_6", ["架桥", "李渡", "罗溪", "民和", "梅庄", "前坊", "文港", "温圳", "张公", "其他"]);
dsy.add("0_15_0_7", ["昌东", "广福", "冈上", "蒋巷", "莲塘", "麻丘", "三江", "塘南", "武阳", "向塘", "幽兰", "其他"]);
dsy.add("0_15_0_8", ["长凌", "乐化", "七里岗", "樵舍", "生米", "石岗", "松湖", "望城", "西山", "溪霞", "象山", "其他"]);

dsy.add("0_15_1", ["崇仁县", "东乡县", "广昌县", "金溪县", "乐安县", "黎川县", "南城县", "南丰县", "宜黄县", "资溪县", "临川区"]);
dsy.add("0_15_2",["安远县","崇义县","大余县","定南县","赣县","章贡区","会昌县","龙南县","南康区","宁都县","全南县","瑞金市","上犹县","石城县","信丰县","兴国县","寻乌县","于都县"]);
dsy.add("0_15_3",["安福县","吉州区","吉安县","吉水县","井冈山市","遂川县","泰和县","万安县","峡江县","新干县","永丰县","永新县","青原区"]);
dsy.add("0_15_4",["浮梁县","昌江区","珠山区","乐平市"]);
dsy.add("0_15_5",["德安县","都昌县","湖口县","庐山区","浔阳区","共青城市","九江县","彭泽县","瑞昌市","武宁县","星子县","修水县","永修县"]);
dsy.add("0_15_6",["莲花县","芦溪县","安源区","湘东区","上栗县"]);
dsy.add("0_15_7",["波阳县","德兴市","广丰县","横峰县","铅山县","信州区","上饶县","万年县","余干县","玉山县","弋阳县","婺源县"]);
dsy.add("0_15_8",["分宜县","渝水区"]);
dsy.add("0_15_9",["丰城市","奉新县","高安市","靖安县","上高县","铜鼓县","万载县","袁州区","宜丰县","樟树市"]);
dsy.add("0_15_10",["贵溪市","月湖区","余江县"]);

dsy.add("0_16", ["沈阳", "鞍山", "本溪", "朝阳", "大连", "丹东", "抚顺", "阜新", "葫芦岛", "锦州", "辽阳", "盘锦", "铁岭", "营口"]);
dsy.add("0_16_0", ["和平区", "沈河区", "大东区", "皇姑区", "铁西区", "东陵区", "浑南区", "沈北新区", "于洪区", "苏家屯区", "新民市", "法库县", "辽中县", "康平县"]);
dsy.add("0_16_0_0", ["北市", "八经", "北道口", "长白", "皇寺", "和平广场", "集贤", "马路湾", "民主", "南湖", "南站", "南京街", "三好街", "遂川", "十四纬路", "胜利", "砂山", "太原街", "五里河", "文体西路", "吴淞", "文化路", "西塔", "新华", "新兴", "云集", "运动系", "园路", "中山广场", "中华路", "其他"]);
dsy.add("0_16_0_1", ["北站", "滨河", "北文萃路", "长青", "大西街", "大南", "二经", "风雨坛", "方家栏", "广宣街", "慧工", "南塔", "市府广场", "山东庙", "顺通", "五爱市场", "文艺路", "文化路", "万莲", "小西", "小南", "新立堡东街", "一经", "中街", "展览馆", "正阳街", "朱剪炉", "其他"]);
dsy.add("0_16_0_2", ["八王寺", "北海街", "北大营", "长安", "草仓", "大北", "东北大马路", "东站", "大东路", "东塔", "二台子", "丰乐", "吉祥", "辽沈", "老瓜堡", "联合路", "滂江街", "上园路", "洮昌", "陶瓷城", "望花", "五中家乐福", "万泉", "小北", "小津桥", "小东", "新东", "珠林", "724地区", "204医院", "其他"]);
dsy.add("0_16_0_3", ["北行", "百鸟公园", "北塔", "北陵", "北三台子", "长江街", "崇山", "长客", "公交厅", "国奥现代城", "黑龙江街", "黄河", "华山", "皇姑屯火车站", "昆山路", "辽河街", "岭东", "岭西", "明廉", "怒江街", "寿泉", "三洞桥", "塔湾", "太平", "泰山路", "五一商店", "渭河", "向工", "新乐", "亚明", "珠江桥", "其他"]);
dsy.add("0_16_0_4", ["爱工街", "保工", "北二路", "北三路", "北四路", "沈辽路", "笃工", "二粮库", "贵和", "工人村", "工业大学", "滑翔小区", "霁虹", "家具城", "九路市场", "建设大路", "劳动公园", "凌空", "路官", "马壮街", "啤酒厂", "齐贤", "启工", "七路", "十二路", "铁西广场", "铁西区政府", "铁西体育场", "铁百", "卫工", "兴工", "兴华", "兴顺", "西站", "兴齐", "云峰", "艳粉", "应昌接", "肇工街", "重工", "其他"]);
dsy.add("0_16_0_5", ["白塔", "东陵", "东湖", "丰乐", "浑河站东", "浑河站西", "马关村", "泉园", "前进", "棋盘山", "桃仙", "五三", "英达", "其他"]);
dsy.add("0_16_0_6", ["奥体中心", "白塔堡", "二十一世纪广场", "富民村", "浑河堡", "浑南中路", "理工大学", "气象局", "世际新城", "音乐学院", "中华园"]);
dsy.add("0_16_0_7", ["财落", "道义", "虎石台", "辉山", "蒲河", "清水台", "新城子", "兴隆台锡伯族", "其他"]);
dsy.add("0_16_0_8", ["白山路", "沈辽路", "城东湖", "长江北街", "丁香湖", "翟家", "大潘镇", "大兴乡", "大青中朝友谊", "东湖市场", "国奥现代城", "和泰新城", "荷兰村", "黑山", "红旗台", "马三家", "南阳湖", "怒江北街", "平罗", "松山小区", "沙岭", "三台子", "西三环", "于洪", "迎宾路", "于洪广场", "杨士", "于洪新城", "于洪区委", "其他"]);
dsy.add("0_16_0_9", ["城郊", "湖西", "解放", "临湖", "民主", "铁友", "中兴", "其他"]);
dsy.add("0_16_0_10", ["东城", "辽滨", "西城", "新柳", "薪城", "其他"]);
dsy.add("0_16_0_11", ["茨榆坨", "长滩", "辽中", "冷子堡", "满都户", "四方台", "肖寨门", "新民屯", "于家房", "杨士岗", "朱家房", "其他"]);
dsy.add("0_16_0_12", ["柏家沟", "登仕堡子", "大孤家子", "丁家房", "法库", "三面船", "秀水河子", "叶茂台", "其他"]);
dsy.add("0_16_0_13", ["东莞屯", "二牛所口", "方家屯", "郝官屯", "康平", "小城子", "张强", "其他"]);

dsy.add("0_16_1",["铁东区","铁西区","立山区","千山区","海城市","台安县","岫岩满族自治县"]);
dsy.add("0_16_2",["本溪满族自治县","平山区","溪湖区","明山区","南芬区","桓仁满族自治县"]);
dsy.add("0_16_3",["北票市","双塔区","龙城区","朝阳县","建平县","喀喇沁左翼蒙古族自治县","凌源市"]);
dsy.add("0_16_4",["长海县","中山区","西岗区","沙河口区","甘井子区","旅顺口区","金州区","普兰店市","瓦房店市","庄河市"]);
dsy.add("0_16_5",["元宝区","振兴区","振安区","东港市","凤城市","宽甸满族自治县"]);
dsy.add("0_16_6",["新抚区","东洲区","望花区","顺城区","抚顺县","清原满族自治县","新宾满族自治县"]);
dsy.add("0_16_7",["阜新蒙古族自治县","海州区","新邱区","太平区","清河门区","细河区","彰武县"]);
dsy.add("0_16_8",["连山区","龙港区","南票区","建昌县","绥中县","兴城市"]);
dsy.add("0_16_9",["北宁市","黑山县","古塔区","凌河区","太和区","凌海市","义县"]);
dsy.add("0_16_10",["灯塔市","白塔区","文圣区","宏伟区","弓长岭区","太子河区","辽阳县"]);
dsy.add("0_16_11",["大洼县","双台子区","兴隆台区","盘山县"]);
dsy.add("0_16_12",["昌图县","调兵山市","开原市","银州区","清河区","铁岭县","西丰县"]);
dsy.add("0_16_13",["大石桥市","盖州市","站前区","西市区","鲅鱼圈区","老边区"]);

dsy.add("0_17", ["呼和浩特", "阿拉善盟", "巴彦淖尔", "包头", "赤峰", "鄂尔多斯", "呼伦贝尔", "通辽", "乌海", "乌兰察布", "锡林郭勒盟", "兴安盟"]);
dsy.add("0_17_0", ["新城区", "赛罕区", "回民区", "玉泉区", "金桥开发区", "如意开发区", "金川开发区", "金山开发区", "和林格尔县", "清水河县", "土默特左旗", "托克托县", "武川县"]);
dsy.add("0_17_0_0", ["阿尔泰游乐园", "八一市场", "长乐宫", "东街", "东风路", "鼓楼", "光华街", "海东路", "毫沁营", "火车站", "润宇", "锡林路", "西街", "新城区政府", "迎新路", "中山东路", "展览馆", "哲里木路", "其他"]);
dsy.add("0_17_0_1", ["巴彦", "长乐宫", "驰誉", "大学西路", "大学东路", "东瓦窑", "鄂尔多斯东街", "丰州路", "金河", "金隅时代城", "桥华世纪村", "人民路", "赛罕区政府", "乌兰察布路", "万达广场", "西把栅乡政府", "榆林", "中专路", "其他"]);
dsy.add("0_17_0_2", ["光明路", "钢铁路", "海拉尔西路", "环河街", "通道街", "新华西路", "西龙王庙", "县府街", "攸攸板", "中山西路", "植物园", "其他"]);
dsy.add("0_17_0_3", ["长和廊", "大南街", "大召", "鄂尔多斯路", "南茶坊", "石羊桥东路", "小召前街", "兴隆巷", "其他"]);
dsy.add("0_17_0_4", ["其他"]);
dsy.add("0_17_0_5", ["其他"]);
dsy.add("0_17_0_6", ["其他"]);
dsy.add("0_17_0_7", ["其他"]);

dsy.add("0_17_1",["阿拉善右旗","阿拉善左旗","额济纳旗"]);
dsy.add("0_17_2",["杭锦后旗","临河区","乌拉特后旗","乌拉特前旗","乌拉特中旗","五原县","磴口县"]);
dsy.add("0_17_3",["东河区","昆都仑区","青山区","石拐区","白云鄂博矿区","九原区","达尔罕茂明安联合旗","固阳县","土默特右旗"]);
dsy.add("0_17_4",["阿鲁科尔沁旗","敖汉旗","巴林右旗","巴林左旗","红山区","元宝山区","松山区","喀喇沁旗","克什克腾旗","林西县","宁城县","翁牛特旗"]);
dsy.add("0_17_5",["达拉特旗","东胜区","鄂托克旗","鄂托克前旗","杭锦旗","乌审旗","伊金霍洛旗","准格尔旗"]);
dsy.add("0_17_6",["阿荣旗","陈巴尔虎旗","额尔古纳市","鄂伦春自治旗","鄂温克族自治旗","根河市","海拉尔区","扎赉诺尔区","满洲里市","莫力达瓦达斡尔族自治旗","新巴尔虎右旗","新巴尔虎左旗","牙克石市","扎兰屯市"]);
dsy.add("0_17_7",["霍林郭勒市","开鲁县","科尔沁左翼后旗","科尔沁左翼中旗","库伦旗","奈曼旗","科尔沁区","扎鲁特旗"]);
dsy.add("0_17_8",["海勃湾区","海南区","乌达区"]);
dsy.add("0_17_9",["察哈尔右翼后旗","察哈尔右翼前旗","察哈尔右翼中旗","丰镇市","化德县","集宁区","凉城县","商都县","四子王旗","兴和县","卓资县"]);
dsy.add("0_17_10",["阿巴嘎旗","东乌珠穆沁旗","多伦县","二连浩特市","苏尼特右旗","苏尼特左旗","太仆寺旗","西乌珠穆沁旗","锡林浩特市","镶黄旗","正蓝旗","正镶白旗"]);
dsy.add("0_17_11",["阿尔山市","科尔沁右翼前旗","科尔沁右翼中旗","突泉县","乌兰浩特市","扎赉特旗"]);

dsy.add("0_18", ["银川", "固原", "石嘴山", "吴忠","中卫市"]);
dsy.add("0_18_0", ["兴庆区", "金凤区", "西夏区", "贺兰县", "灵武市", "永宁县"]);
dsy.add("0_18_0_0", ["富宁街", "解放西街", "前进街", "胜利街", "文化街", "新华街", "玉皇阁北街", "中山南街", "其他"]);
dsy.add("0_18_0_1", ["铁东", "新城东街", "其他"]);
dsy.add("0_18_0_2", ["北京西路", "宁华路", "朔方路", "文昌路", "西花园路", "其他"]);

dsy.add("0_18_1",["原州区","隆德县","彭阳县","西吉县","泾源县"]);
dsy.add("0_18_2",["惠农区","平罗县","大武口区"]);
dsy.add("0_18_3",["青铜峡市","同心县","盐池县","利通区","红寺堡区"]);
dsy.add("0_18_4", ["沙坡头区", "中宁县", "海原县"]);


dsy.add("0_19", ["西宁", "果洛藏族自治州", "海北藏族自治州", "海东", "海南藏族自治州", "海西蒙古族藏族自治州", "黄南藏族自治州", "玉树藏族自治州"]);
dsy.add("0_19_0", ["城东区", "城西区", "城北区", "城中区", "大通回族土族自治县", "湟中县", "湟源县"]);
dsy.add("0_19_0_0", ["八一路", "曹家寨", "东关大街", "大众街", "付家寨", "火车站", "昆仑东路", "林家崖", "清真巷", "小寨", "周家泉", "其他"]);
dsy.add("0_19_0_1", ["滨河南路", "北大街", "仓门街", "长江路", "礼让街", "莫家街", "南滩", "南川东路", "南山路", "南大街", "七一路", "人民街", "夏都大街", "饮马街", "其他"]);
dsy.add("0_19_0_2", ["古城台", "虎台", "海晏路", "昆仑西路", "南川西路", "胜利路", "五四大街", "五岔路口", "西关大街", "兴海路", "西川南路", "其他"]);
dsy.add("0_19_0_3", ["朝阳", "柴达木路", "大寺沟", "马坊", "祁连路", "三其", "小桥", "盐庄", "其他"]);
dsy.add("0_19_0_4", ["其他"]);
dsy.add("0_19_0_5", ["其他"]);
dsy.add("0_19_0_6", ["其他"]);

dsy.add("0_19_1", ["班玛县", "达日县", "甘德县", "久治县", "玛多县", "玛沁县"]);
dsy.add("0_19_2", ["刚察县", "海晏县", "门源回族自治县", "祁连县"]);
dsy.add("0_19_3", ["互助土族自治县", "化隆回族自治县", "乐都县", "民和回族土族自治县", "平安县", "循化撒拉族自治县", "湟中县", "湟源县"]);
dsy.add("0_19_4", ["共和县", "贵德县", "贵南县", "同德县", "兴海县"]);
dsy.add("0_19_5", ["德令哈市", "都兰县", "格尔木市", "天峻县", "乌兰县", "冷湖行委", "大柴旦行委", "茫崖行委"]);
dsy.add("0_19_6", ["河南蒙古族自治县", "尖扎县", "同仁县", "泽库县"]);
dsy.add("0_19_7", ["称多县", "囊谦县", "曲麻莱县", "玉树县", "杂多县", "治多县"]);

dsy.add("0_20", ["济南", "滨州", "德州", "东营", "菏泽", "济宁", "莱芜", "聊城", "临沂", "青岛", "日照", "泰安", "威海", "潍坊", "烟台", "枣庄", "淄博"]);
dsy.add("0_20_0", ["历下区", "市中区", "天桥区", "历城区", "槐荫区", "高新区", "长清区", "济阳县", "平阴县", "商河县", "章丘市", "长清县"]);
dsy.add("0_20_0_0", ["趵突泉", "泺源大街", "趵突泉北路", "东门", "关东", "甸柳新村", "关东大街", "二环东路南段", "和平路", "环山路", "黑虎泉西路", "解放路", "建筑新村", "解放东路", "经十路历下段", "浆水泉路", "历山路", "明湖路", "泉城路", "千佛山", "司里街", "山大南路", "文化东路", "文化西路", "燕子山路", "燕子立交", "其他"]);
dsy.add("0_20_0_1", ["泺源", "白马山", "八一立交桥", "岔路街", "大观园", "党家镇", "二七新村", "三环南路", "杆石桥", "馆驿街", "经二路", "经七路", "建设路", "经十路中段", "经一路", "济微路", "郎茂山", "六里山", "七里山", "人民商场", "四里村", "舜王路", "舜耕网", "十六里河", "魏家庄", "王官庄", "英雄山路", "玉函路", "其他"]);
dsy.add("0_20_0_2", ["宝华街", "北坦街", "北园", "泺口", "标山路", "成丰路", "堤口路", "东工商河路", "大桥镇", "凤凰山路", "工人新村北村", "官扎营", "工人新村南村", "皇岗路", "济泺路 ", "济齐路", "聚贤街", "历山北路", "明湖北路", "明湖西路", "清河路", "水屯路", "师范路", "三孔桥街", "生产路", "水屯北路", "天桥东街", "天成路", "纬北路", "无影山", "无影山中路", "无影山北路", "无影山路", "无影山东路", "无影山西路", "药山", "制锦市", "其他"]);
dsy.add("0_20_0_3", ["北园大街历城段", "东风", "二环东路北段", "工业北路", "盖家沟", "洪家楼", "花园路", "化纤厂路", "黄台南路", "华山镇", "将军路", "经十东路", "柳埠镇", "闵子骞路", "全福", "七里堡", "七里河", "清河北路", "全福庄", "山大路", "山大北路", "王舍人", "祝甸", "仲宫", "其他"]);
dsy.add("0_20_0_4", ["八里桥", "北小辛庄", "道德街", "段店北路", "段店", "二环西路", "经三路", "经七纬十二", "经十西路", "机床二厂路", "机场西路", "济齐路西段", "匡山", "腊山北路", "刘长山路", "美里湖", "南辛庄", "青年公园", "市华联", "五里沟", "五院", "西市场", "幸福街", "营市街", "阳光新路", "中大槐树", "振兴街", "张庄路", "其他"]);
dsy.add("0_20_0_5", ["奥体中心", "崇华路", "工业南路", "国际会展中心", "华龙路", "华信路", "开拓路", "旅游路高新段", "齐鲁软件园", "舜华路", "其他"]);
dsy.add("0_20_0_6", ["崮云湖", "平安", "文昌", "五峰山", "其他"]);

dsy.add("0_20_1",["滨城区","博兴县","惠民县","无棣县","阳信县","沾化区","邹平县"]);
dsy.add("0_20_2",["德城区","乐陵市","临邑县","陵城区","宁津县","平原县","齐河县","庆云县","武城县","夏津县","禹城市"]);
dsy.add("0_20_3",["东营区","河口区","广饶县","垦利县","利津县"]);
dsy.add("0_20_4",["曹县","成武县","单县","定陶县","东明县","牡丹区","巨野县","郓城县","鄄城县"]);
dsy.add("0_20_5",["任城区","嘉祥县","金乡县","梁山县","曲阜市","微山县","鱼台县","邹城市","兖州区","汶上县","泗水县"]);
dsy.add("0_20_6",["莱城区","钢城区"]);
dsy.add("0_20_7",["东阿县","高唐县","冠县","东昌府区","临清市","阳谷县","茌平县","莘县"]);
dsy.add("0_20_8",["苍山县","费县","河东区","兰山区","罗庄区","临沭县","蒙阴县","平邑县","沂南县","沂水县","郯城县","莒南县"]);
dsy.add("0_20_9",["即墨市","胶州市","莱西市","平度市","市南区","市北区","黄岛区","崂山区","李沧区","城阳区"]);
dsy.add("0_20_10",["东港区","岚山区","五莲县","莒县"]);
dsy.add("0_20_11",["东平县","肥城市","宁阳县","泰山区","岱岳区","新泰市"]);
dsy.add("0_20_12",["荣成市","乳山市","环翠区","文登区"]);
dsy.add("0_20_13",["安丘市","昌乐县","昌邑市","高密市","临朐县","青州市","寿光市","潍城区","寒亭区","坊子区","奎文区","诸城市"]);
dsy.add("0_20_14",["长岛县","海阳市","莱阳市","莱州市","龙口市","蓬莱市","栖霞市","芝罘区","福山区","牟平区","莱山区","招远市"]);
dsy.add("0_20_15",["市中区","薛城区","峄城区","台儿庄区","山亭区","滕州市"]);
dsy.add("0_20_16",["高青县","桓台县","沂源县","淄川区","张店区","博山区","临淄区","周村区"]);

dsy.add("0_21", ["太原", "长治", "大同", "晋城", "晋中", "临汾", "吕梁", "朔州", "忻州", "阳泉", "运城"]);
dsy.add("0_21_0", ["杏花岭区", "小店区", "迎泽区", "尖草坪区", "万柏林区", "晋源区", "古交市", "娄烦县", "清徐县", "阳曲县"]);
dsy.add("0_21_0_0", ["坝陵桥", "北大街", "大东关", "敦化坊", "动物园", "府东府西", "鼓楼", "旱西关", "涧河", "巨轮", "建设北路", "龙潭公园", "三桥", "赛马场", "三墙路", "胜利街", "五一路", "五龙口", "小东门", "杨家峪", "职工新村", "中涧河", "其他"]);
dsy.add("0_21_0_1", ["北营", "滨河东路", "并州南路", "长风街", "长治路", "富士康", "高新区", "黄陵", "恒大绿洲", "建设南路", "经济技术开发区", "晋阳街", "龙城大街", "南中环", "平阳路", "亲贤", "双塔", "体育路", "太榆路", "坞城", "王村南街", "小店", "学府街", "许坦东西街", "其他"]);
dsy.add("0_21_0_2", ["并州北路", "并州东西街", "朝阳", "大南门", "大营盘", "服装城", "郝庄", "解放路", "柳巷", "老军营", "庙前", "南内环", "桥东", "青年路", "双塔东西街", "水西关", "体育馆", "桃园", "文庙", "五一广场", "迎泽", "其他"]);
dsy.add("0_21_0_3", ["北宫", "柴村", "光社", "尖草坪", "南寨", "上兰", "胜利桥", "迎新街", "其他"]);
dsy.add("0_21_0_4", ["滨河西路", "东社", "和平", "和平路", "南寒", "千峰", "万柏林", "兴华", "下元", "西宫", "西客站", "小井", "漪汾", "迎泽西大街", "其他"]);
dsy.add("0_21_0_5", ["晋源", "金胜", "晋祠", "罗城", "义井", "其他"]);
dsy.add("0_21_0_6", ["其他"]);
dsy.add("0_21_0_7", ["其他"]);
dsy.add("0_21_0_8", ["其他"]);
dsy.add("0_21_0_9", ["其他"]);


dsy.add("0_21_1",["城区","郊区","长治县","长子县","壶关县","黎城县","潞城市","平顺县","沁县","沁源县","屯留县","武乡县","襄垣县"]);
dsy.add("0_21_2",["城区","矿区","南郊区","新荣区","大同县","广灵县","浑源县","灵丘县","天镇县","阳高县","左云县"]);
dsy.add("0_21_3",["高平市","城区","陵川县","沁水县","阳城县","泽州县"]);
dsy.add("0_21_4",["和顺县","介休市","榆次区","灵石县","平遥县","祁县","寿阳县","太谷县","昔阳县","榆社县","左权县"]);
dsy.add("0_21_5",["安泽县","大宁县","汾西县","浮山县","古县","洪洞县","侯马市","霍州市","吉县","尧都区","蒲县","曲沃县","襄汾县","乡宁县","翼城县","永和县","隰县"]);
dsy.add("0_21_6",["方山县","汾阳市","交城县","交口县","离石区","临县","柳林县","石楼县","文水县","孝义市","兴县","中阳县","岚县"]);
dsy.add("0_21_7",["怀仁县","山阴县","朔城区","平鲁区","应县","右玉县"]);
dsy.add("0_21_8",["保德县","代县","定襄县","繁峙县","河曲县","静乐县","宁武县","偏关县","神池县","五台县","五寨县","忻府区","原平市","岢岚县"]);
dsy.add("0_21_9",["平定县","城区","矿区","郊区","盂县"]);
dsy.add("0_21_10",["河津市","临猗县","平陆县","万荣县","闻喜县","夏县","新绛县","永济市","垣曲县","盐湖区","芮城县","绛县","稷山县"]);

dsy.add("0_22", ["西安", "安康", "宝鸡", "汉中", "商洛", "铜川", "渭南", "咸阳", "延安", "榆林"]);
dsy.add("0_22_0", ["莲湖区", "新城区", "碑林区", "雁塔区", "灞桥区", "未央区", "阎良区", "临潼区", "长安区", "高新区", "高陵区", "户县", "蓝田县", "西安市", "周至县", "长安县"]);
dsy.add("0_22_0_0", ["北院门", "北关", "北大街", "城西客运站", "大兴路", "大庆路", "丰庆路", "丰禾路", "丰登路", "高科花园", "红庙坡", "环城西路", "锦园小区", "昆明路", "劳动路", "庙后街", "青年路", "土门", "土门", "甜水井", "西大街", "西关", "西稍门", "玉祥门", "枣园", "自强西路", "其他"]);
dsy.add("0_22_0_1", ["长乐中路", "长乐西路", "长缨东路", "东五路", "韩森寨", "胡家庙", "互助路立交", "解放门", "金花路", "建政街道", "康复路", "人民路", "尚勤路", "太华路", "文昌门", "万寿路", "西一路", "西五路", "新城街道", "西京医院", "迎新路", "中山门", "自强路", "中山东路", "其他"]);
dsy.add("0_22_0_2", ["安东街", "安西街", "柏树林", "边家村", "长乐坊", "长安路", "东关南街", "东大街", "大差市", "东木头市", "东门外", "大学南路", "广济街", "和平路", "何家村", "环城南路", "建设路", "南大街", "南院门", "太乙路", "文艺路", "小雁塔", "张家村", "朱雀大街", "其他"]);
dsy.add("0_22_0_3", ["北山门", "长延堡", "翠华路", "大雁塔", "电子城", "等驾坡", "电视塔", "丁白路", "电子正街", "东仪路", "电子商城", "国展中心", "光路", "吉祥路", "明德门", "市政府小区", "太白小区", "太白南路", "小寨路", "西影路", "鱼化寨", "杨家村", "永松路", "丈八东路", "朱雀大街", "其他"]);
dsy.add("0_22_0_4", ["浐灞半岛", "浐河西路", "纺织城", "红旗", "洪庆", "十里铺", "席王", "西航花园", "其他"]);
dsy.add("0_22_0_5", ["草滩", "大观园", "二府庄", "二马路", "凤城一路", "方新村", "凤城四路", "凤城二路", "凤城三路", "凤城五路", "凤城六路", "凤城七路", "凤城八路", "凤城九路", "经济技术开发区", "龙首村", "龙首北路", "明光路", "三桥", "文景路", "徐家湾", "辛家庙", "雅荷花园", "张家堡", "朱宏路", "其他"]);
dsy.add("0_22_0_6", ["凤凰路", "关山", "武屯", "新华路", "其他"]);
dsy.add("0_22_0_7", ["代王", "骊山", "秦陵", "新丰", "斜口", "行者", "其他"]);
dsy.add("0_22_0_8", ["长安区政府", "长安周边", "斗门", "东大", "郭杜", "航天城", "滦镇", "马王", "太乙宫", "韦曲", "王寺", "韦曲西街", "西京大学", "西寨", "西长安街", "引镇", "子午", "其他"]);
dsy.add("0_22_0_9", ["沣惠南路", "高新二路", "高新路", "光华路", "高新四路", "高新周边", "高新六路", "锦业路", "锦业一路", "科技四路西段", "科技二路", "科技一路", "科技路西口", "科技六路", "科创路", "玫瑰大楼", "唐延路", "团结南路", "旺座现代城", "亚美大厦", "紫薇田园都市", "丈八北路", "其他"]);


dsy.add("0_22_1",["汉滨区","白河县","汉阴县","宁陕县","平利县","石泉县","旬阳县","镇坪县","紫阳县","岚皋县"]);
dsy.add("0_22_2",["渭滨区","金台区","陈仓区","凤县","凤翔县","扶风县","陇县","眉县","千阳县","太白县","岐山县","麟游县"]);
dsy.add("0_22_3",["城固县","佛坪县","汉台区","留坝县","略阳县","勉县","南郑县","宁强县","西乡县","洋县","镇巴县"]);
dsy.add("0_22_4",["丹凤县","洛南县","山阳县","商州区","商南县","镇安县","柞水县"]);
dsy.add("0_22_5",["王益区","印台区","宜君县","耀州区"]);
dsy.add("0_22_6",["白水县","澄城县","大荔县","富平县","韩城市","合阳县","华县","华阴市","蒲城县","临渭区","潼关县"]);
dsy.add("0_22_7",["彬县","长武县","淳化县","礼泉县","乾县","三原县","武功县","秦都区","杨陵区","渭城区","兴平市","旬邑县","永寿县","泾阳县"]);
dsy.add("0_22_8",["安塞县","富县","甘泉县","黄陵县","黄龙县","洛川县","吴旗县","宝塔区","延长县","延川县","宜川县","志丹县","子长县"]);
dsy.add("0_22_9",["定边县","府谷县","横山县","佳县","靖边县","米脂县","清涧县","神木县","绥德县","吴堡县","榆阳区","子洲县"]);

dsy.add("0_23", ["成都","阿坝藏族羌族自治州", "巴中", "达州", "德阳", "甘孜藏族自治州", "广安", "广元", "乐山", "凉山彝族自治州", "眉山", "绵阳", "南充", "内江", "攀枝花", "遂宁", "雅安", "宜宾", "资阳", "自贡", "泸州"]);
dsy.add("0_23_0", ["武侯区", "青羊区", "金牛区", "锦江区", "成华区", "高新区", "双流县", "温江区", "郫县", "高新西区", "龙泉驿区", "新都区", "青白江区", "金堂县", "都江堰市", "彭州市", "崇州市", "大邑县", "邛崃市", "蒲江县", "新津县"]);
dsy.add("0_23_0_0", ["簇桥", "桂溪", "高升桥", "红牌楼", "火车南站", "航空路", "浆洗街", "机头镇", "金花镇", "机头桥", "磨子桥", "内双楠", "清水河", "石羊", "跳伞塔", "桐梓林", "望江路", "外双楠", "五大花园", "武侯祠大街", "小天竺", "肖家河", "洗面桥", "玉林", "致民路", "其他"]);
dsy.add("0_23_0_1", ["贝森", "八宝街", "百花中心站", "白果林", "草市街", "长顺街", "草堂", "东坡", "府南新区", "光华", "黄田坝", "金沙", "青羊小区", "人民公园", "苏坡", "顺城街", "太升路", "天府广场", "文家", "浣花小区", "新华西路", "西南财大", "中医附院", "其他"]);
dsy.add("0_23_0_2", ["茶店子", "凤凰山", "抚琴", "黄忠", "荷花池", "火车北站", "花牌坊", "九里堤", "金泉", "交大路", "李家沱", "梁家巷", "马鞍路", "人民北路", "沙河源", "蜀汉路", "沙湾", "天回", "五块石", "西安路", "西华", "营门口", "其他"]);
dsy.add("0_23_0_3", ["滨江路", "春熙路", "成龙路", "成仁路", "川师", "东光", "合江亭", "海椒市", "红星路", "九眼桥", "龙舟路", "柳江", "莲桂路", "牛市口", "牛沙路", "牛王庙", "书院街", "水碾河", "双桂路", "狮子山", "沙河", "三圣", "万达", "新南门", "盐市口", "其他"]);
dsy.add("0_23_0_4", ["八里小区", "八里庄", "成渝立交", "动物园", "二仙桥", "府青路", "建设路", "龙潭", "猛追湾", "青龙", "驷马桥", "双桥子", "圣灯", "双水碾", "跳蹬河", "五桂桥", "万年场", "新鸿路", "新华公园", "玉双路", "其他"]);
dsy.add("0_23_0_5", ["创业路", "大源村", "大源", "芳草街", "金融城", "理想中心", "美年广场", "南延线", "南苑", "神仙树", "市一医院", "天府软件园", "天府长城", "天府大道", "肖家河", "新会展", "新北", "紫荆", "中和"]);
dsy.add("0_23_0_6", ["白家", "白沙", "东升", "大林", "公兴", "华阳", "航空港", "黄水", "黄甲", "合江", "黄龙溪", "籍田", "九江", "煎茶", "金桥", "彭镇", "胜利", "三星", "太平", "文星", "万安", "新兴", "兴隆", "永兴", "永安", "正兴", "其他"]);
dsy.add("0_23_0_7", ["光华大道", "公平", "和盛", "金马", "南熏大道", "寿安", "天府", "温江城区", "万春", "永盛", "永宁", "其他"]);
dsy.add("0_23_0_8", ["安德", "安靖", "德源", "古城", "红光", "花园", "郫筒", "三道堰", "唐昌", "唐元", "团结", "犀浦", "新民场", "友爱", "其他"]);
dsy.add("0_23_0_9", ["何家桥", "土桥", "中海国际"]);
dsy.add("0_23_0_10", ["大面", "洪河", "龙泉", "十陵", "同安", "其他"]);
dsy.add("0_23_0_11", ["斑竹园", "大丰", "军屯", "龙桥", "马家", "木兰", "清流", "三河", "石板滩", "泰兴", "新都", "新繁", "新民", "其他"]);
dsy.add("0_23_0_12", ["大弯", "红阳", "其他"]);
dsy.add("0_23_0_13", ["白果", "福兴", "官仓", "广兴", "高板", "淮口", "金龙", "隆盛", "清江", "三星", "三溪", "土桥", "五凤", "云合", "又新", "赵镇", "竹篙", "赵家", "转龙", "其他"]);
dsy.add("0_23_0_14", ["安龙", "崇义", "翠月湖", "大观", "灌口", "聚源", "龙池", "柳街", "蒲阳", "青城山", "石羊", "天马", "幸福", "胥家", "玉堂", "中兴", "紫平铺", "其他"]);
dsy.add("0_23_0_15", ["敖平", "白鹿", "磁峰", "丹景山", "桂花", "葛仙山", "红岩", "九尺", "军乐", "隆丰", "丽春", "龙门山", "濛阳", "三界", "升平", "天彭", "通济", "新兴", "小鱼洞", "致和", "其他"]);
dsy.add("0_23_0_16", ["安西", "邓双", "方兴", "花桥", "花源", "金华", "普兴", "五津", "兴义", "新平", "用商", "其他"]);
dsy.add("0_23_0_17", ["白头", "崇阳", "崇平", "道明", "大划", "观胜", "怀远", "街子", "江源", "廖家", "隆兴", "桤泉", "三江", "三郎", "万家", "王场", "元通", "羊马", "梓潼", "其他"]);
dsy.add("0_23_0_18", ["安仁", "出江", "蔡场", "董场", "韩场", "花水湾", "晋源", "青霞", "三岔", "上安", "苏家", "沙渠", "王泗", "西岭", "斜源", "新场", "悦来", "其他"]);
dsy.add("0_23_0_19", ["宝林", "顾驿", "高埂", "高何", "火井", "回龙", "夹关", "临邛", "临济", "牟礼", "平乐", "前进", "冉义", "水口", "桑园", "天台山", "卧龙", "羊安", "其他"]);
dsy.add("0_23_0_20", ["朝阳湖", "成佳", "大塘", "大兴", "甘溪", "鹤山", "寿安", "西来", "其他"]);
dsy.add("0_23_0_21", ["其他"]);


dsy.add("0_23_1", ["阿坝县", "黑水县", "红原县", "金川县", "九寨沟县", "理县", "马尔康县", "茂县", "壤塘县", "若尔盖县", "松潘县", "小金县", "汶川县"]);
dsy.add("0_23_2",["巴州区","恩阳区","南江县","平昌县","通江县"]);
dsy.add("0_23_3",["达川区","通川区","大竹县","开江县","渠县","万源市","宣汉县"]);
dsy.add("0_23_4",["旌阳区","广汉市","罗江县","绵竹市","什邡市","中江县"]);
dsy.add("0_23_5",["巴塘县","白玉县","丹巴县","稻城县","道孚县","德格县","得荣县","甘孜县","九龙县","康定县","理塘县","炉霍县","色达县","石渠县","乡城县","新龙县","雅江县","泸定县"]);
dsy.add("0_23_6",["广安区","前锋区","华蓥市","邻水县","武胜县","岳池县"]);
dsy.add("0_23_7",["苍溪县","利州区","昭化区","朝天区","剑阁县","青川县","旺苍县"]);
dsy.add("0_23_8",["峨边彝族自治县","峨眉山市","夹江县","井研县","市中区","沙湾区","五通桥区","金口河区","马边彝族自治县","沐川县","犍为县"]);
dsy.add("0_23_9",["布拖县","德昌县","甘洛县","会东县","会理县","金阳县","雷波县","美姑县","冕宁县","木里藏族自治县","宁南县","普格县","西昌市","喜德县","盐源县","越西县","昭觉县"]);
dsy.add("0_23_10",["丹棱县","洪雅县","东坡区","彭山区","青神县","仁寿县"]);
dsy.add("0_23_11",["安县","北川羌族自治县","江油市","涪城区","游仙区","平武县","三台县","盐亭县","梓潼县"]);
dsy.add("0_23_12",["南部县","顺庆区","高坪区","嘉陵区","蓬安县","西充县","仪陇县","营山县","阆中市"]);
dsy.add("0_23_13",["隆昌县","市中区","东兴区","威远县","资中县"]);
dsy.add("0_23_14",["米易县","东区","西区","仁和区","盐边县"]);
dsy.add("0_23_15",["大英县","蓬溪县","射洪县","船山区","安居区"]);
dsy.add("0_23_16",["宝兴县","汉源县","芦山县","名山区","石棉县","天全县","雨城区","荥经县"]);
dsy.add("0_23_17",["长宁县","高县","江安县","南溪区","屏山县","兴文县","翠屏区","宜宾县","珙县","筠连县"]);
dsy.add("0_23_18",["安岳县","简阳市","乐至县","雁江区"]);
dsy.add("0_23_19",["富顺县","荣县","自流井区","贡井区","大安区","沿滩区"]);
dsy.add("0_23_20",["古蔺县","合江县","叙永县","泸县","江阳区","纳溪区","龙马潭区"]);

dsy.add("0_24", ["拉萨", "阿里", "昌都", "林芝", "那曲", "日喀则", "山南"]);
dsy.add("0_24_0", ["达孜县", "当雄县", "堆龙德庆县", "城关区", "林周县", "墨竹工卡县", "尼木县", "曲水县"]);
dsy.add("0_24_0_0", ["邦堆", "德庆", "拉木", "穷达", "桑珠林", "塔吉", "唐嘎", "雪乡", "章多", "其他"]);
dsy.add("0_24_0_1", ["当曲卡", "公塘", "格达", "龙仁", "纳木湖", "宁中", "乌玛塘", "羊八井", "其他"]);
dsy.add("0_24_0_2", ["德庆", "东嘎", "古荣", "柳梧", "马乡", "乃琼", "羊达", "其他"]);
dsy.add("0_24_0_3", ["八廓", "冲赛康", "公德林", "吉日", "吉崩岗", "扎基", "其他"]);
dsy.add("0_24_0_4", ["阿朗", "班觉林", "春堆", "藏雄", "达龙", "甘丹曲果", "改布", "江热夏", "江多", "拉康", "牛玛", "旁多", "强嘎", "切玛", "卡孜", "松昌", "塘果", "乌鲁隆", "朱加", "其他"]);
dsy.add("0_24_0_5", ["工卡", "甲玛", "门巴", "尼玛江热", "如多", "塘加", "扎雪", "扎西岗", "其他"]);
dsy.add("0_24_0_6", ["东嘎", "霍德", "林岗", "麻江", "尼木", "彭岗", "帕古", "普松", "卡如", "塔荣", "吞巴", "续普", "续迈", "其他"]);
dsy.add("0_24_0_7", ["菜纳", "茶巴朗", "茶巴拉", "达嘎", "聂唐", "南木", "曲水", "曲甫", "其奴", "色麦", "其他"]);

dsy.add("0_24_1",["措勤县","噶尔县","改则县","革吉县","普兰县","日土县","札达县"]);
dsy.add("0_24_2",["八宿县","边坝县","察雅县","昌卡若区","丁青县","贡觉县","江达县","类乌齐县","洛隆县","芒康县","左贡县"]);
dsy.add("0_24_3",["波密县","察隅县","工布江达县","朗县","林芝县","米林县","墨脱县"]);
dsy.add("0_24_4",["安多县","巴青县","班戈县","比如县","嘉黎县","那曲县","尼玛县","聂荣县","申扎县","索县","双湖县"]);
dsy.add("0_24_5",["昂仁县","白朗县","定结县","定日县","岗巴县","吉隆县","江孜县","康马县","拉孜县","南木林县","聂拉木县","仁布县","桑珠孜区","萨嘎县","萨迦县","谢通门县","亚东县","仲巴县"]);
dsy.add("0_24_6",["措美县","错那县","贡嘎县","加查县","浪卡子县","隆子县","洛扎县","乃东县","琼结县","曲松县","桑日县","扎囊县"]);

dsy.add("0_25", ["乌鲁木齐", "阿克苏", "阿拉尔", "巴音郭楞蒙古自治州", "博尔塔拉蒙古自治州", "昌吉回族自治州", "哈密", "和田", "喀什", "克拉玛依", "克孜勒苏柯尔克孜自治州", "石河子", "图木舒克", "吐鲁番", "五家渠", "伊犁哈萨克自治州"]);
dsy.add("0_25_0", ["天山区", "沙依巴克区", "新市区", "水磨沟区", "头屯河区", "东山区", "达坂城区", "乌鲁木齐县","米东区"]);
dsy.add("0_25_0_0", ["北门", "翠泉街", "东门", "大湾南路", "大湾北路", "大西门", "东泉路", "光明路", "和平路", "解放南路", "解放北路", "碱泉", "金银路", "龙泉街", "民主路", "南门", "青年路", "前进街", "人民广场", "人民路", "胜利路", "赛马场", "团结路", "体育馆路", "天山区周边", "五星路", "新华南路", "新华北路", "幸福路", "小西门", "燕尔窝", "延安路", "中山路商业区", "其他"]);
dsy.add("0_25_0_1", ["阿勒泰路", "八一", "宝山路", "北园春", "长江路", "仓房沟路", "和田街", "黄河路", "红庙子", "火车南站", "九家湾", "炉院街", "明园", "平顶山", "奇台路", "骑马山路", "钱塘江路", "商贸城", "沙依巴克区周边", "西山", "西北路", "新北园春", "友好南路", "友好北路", "扬子江路", "雅玛里克山", "雅山北路", "友好", "珠江路", "其他"]);
dsy.add("0_25_0_2", ["北京路", "北站东路", "北京南路", "长春路", "长沙路", "二工", "二宫", "杭州路", "河北路", "喀什东路", "科技园路", "鲤鱼山路", "美居物流园", "南纬路", "三工", "石油新村", "苏州西街", "苏州东街", "天津路", "太原路", "铁路局", "通嘉世纪城", "卫星路", "乌鲁木齐机场", "西八家户路", "小西沟", "新市区周边", "迎宾路", "银川路", "友朋街", "中亚路", "植物园", "蜘蛛山", "其他"]);
dsy.add("0_25_0_3", ["八道湾", "华凌", "红山公园", "红光山", "会展中心", "红山路华东南路", "昆仑路", "六道湾", "南湖南路", "南湖北路", "南湖", "七纺商业圈", "水磨沟", "市政府", "水磨沟公园", "苏州东路沿段", "时代广场", "水磨沟区周边", "苇湖梁", "温泉路", "王家梁", "五星北路", "新民路", "西虹东路", "其他"]);
dsy.add("0_25_0_4", ["北站西路", "八钢", "火车西站", "头屯河", "屯坪北路", "屯坪南路", "头屯河区周边", "王家沟", "乌昌路", "卫星广场", "其他"]);
dsy.add("0_25_0_5", ["地磅", "卡子湾", "石化", "其他"]);
dsy.add("0_25_0_6", ["艾维尔沟", "乌拉泊", "星火", "鱼儿沟", "其他"]);
dsy.add("0_25_0_7", ["安宁渠", "水西沟", "其他"]);
dsy.add("0_25_0_8", ["东华南路", "府前路", "广兴街", "碱沟西路", "开源路", "米东南路", "米东中路", "米东北路", "七道湾北路", "永顺街", "振兴路", "振兴中路", "振兴北路"]);

dsy.add("0_25_1", ["阿克苏市", "阿瓦提县", "拜城县", "柯坪县", "库车县", "沙雅县", "温宿县", "乌什县", "新和县"]);
dsy.add("0_25_2",["阿拉尔市"]);
dsy.add("0_25_3",["博湖县","和静县","和硕县","库尔勒市","轮台县","且末县","若羌县","尉犁县","焉耆回族自治县"]);
dsy.add("0_25_4",["博乐市","精河县","阿拉山口市","温泉县"]);
dsy.add("0_25_5",["昌吉市","阜康市","呼图壁县","吉木萨尔县","玛纳斯县","木垒哈萨克自治县","奇台县"]);
dsy.add("0_25_6",["巴里坤哈萨克自治县","哈密市","伊吾县"]);
dsy.add("0_25_7",["策勒县","和田市","和田县","洛浦县","民丰县","墨玉县","皮山县","于田县"]);
dsy.add("0_25_8",["巴楚县","喀什市","麦盖提县","莎车县","疏附县","疏勒县","塔什库尔干塔吉克自治县","叶城县","英吉沙县","岳普湖县","泽普县","伽师县"]);
dsy.add("0_25_9",["克拉玛依市"]);
dsy.add("0_25_10",["阿合奇县","阿克陶县","阿图什市","乌恰县"]);
dsy.add("0_25_11",["石河子市"]);
dsy.add("0_25_12",["图木舒克市"]);
dsy.add("0_25_13",["吐鲁番市","托克逊县","鄯善县"]);
dsy.add("0_25_14",["五家渠市"]);
dsy.add("0_25_15",["阿勒泰市","布尔津县","察布查尔锡伯自治县","额敏县","福海县","富蕴县","巩留县","哈巴河县","和布克赛尔蒙古自治县","霍城县","吉木乃县","奎屯市","尼勒克县","青河县","沙湾县","塔城市","特克斯县","托里县","乌苏市","新源县","伊宁市","伊宁县","裕民县","昭苏县"]);

dsy.add("0_26", ["昆明", "保山", "楚雄彝族自治州", "大理白族自治州", "德宏傣族景颇族自治州", "迪庆藏族自治州", "红河哈尼族彝族自治州", "丽江", "临沧", "怒江傈傈族自治州", "曲靖", "普洱", "文山壮族苗族自治州", "西双版纳傣族自治州", "玉溪", "昭通"]);
dsy.add("0_26_0", ["盘龙区", "五华区", "西山区", "官渡区", "东川区", "安宁市", "呈贡区", "富民县", "晋宁县", "禄劝彝族苗族自治县", "石林彝族自治县", "寻甸回族自治县", "宜良县", "嵩明县"]);
dsy.add("0_26_0_0", ["白塔路", "北辰财富中心", "白龙路片区", "滨江俊园", "茨坝", "东华", "董家湾", "鼓楼片区", "环城", "火车北站", "江东花园", "金殿片区", "金星立交桥", "龙泉", "世博片区", "拓东", "昙华寺片区", "新迎片区", "张官营", "其他"]);
dsy.add("0_26_0_1", ["北市区", "翠湖", "大观", "丰宁片区", "高新区", "华山", "黑林铺", "虹山片区", "黄土坡", "龙翔", "莲花片区", "龙泉路", "南屏街片区", "普吉", "小西门", "其他"]);
dsy.add("0_26_0_2", ["碧鸡", "船房片区", "滇池路片区", "大商汇", "滇池度假区", "海口", "金碧片区", "马街", "前卫", "前卫营", "西山区政府", "云纺片区", "永昌", "棕树营", "其他"]);
dsy.add("0_26_0_3", ["东站", "关上", "国贸中心", "官南大道", "和平村", "金马", "经济开发区", "建工新城", "昆明机场", "民航路", "南窑片区", "世纪城", "新螺蛳湾", "新亚洲体育城", "其他"]);
dsy.add("0_26_0_4", ["碧谷", "汤丹", "新村", "因民", "其他"]);
dsy.add("0_26_0_5", ["八街", "草铺", "连然", "青龙", "太平新城", "温泉", "其他"]);
dsy.add("0_26_0_6", ["龙城", "洛羊", "其他"]);
dsy.add("0_26_0_7", ["大营", "永定", "其他"]);
dsy.add("0_26_0_8", ["古城", "晋城", "昆阳", "其他"]);
dsy.add("0_26_0_9", ["其他"]);
dsy.add("0_26_0_10", ["其他"]);
dsy.add("0_26_0_11", ["其他"]);
dsy.add("0_26_0_12", ["其他"]);
dsy.add("0_26_0_13", ["其他"]);

dsy.add("0_26_1", ["隆阳区", "昌宁县", "龙陵县", "施甸县", "腾冲县"]);
dsy.add("0_26_2",["楚雄市","大姚县","禄丰县","牟定县","南华县","双柏县","武定县","姚安县","永仁县","元谋县"]);
dsy.add("0_26_3",["宾川县","大理市","洱源县","鹤庆县","剑川县","弥渡县","南涧彝族自治县","巍山彝族回族自治县","祥云县","漾濞彝族自治县","永平县","云龙县"]);
dsy.add("0_26_4",["梁河县","陇川县","潞西市","瑞丽市","盈江县"]);
dsy.add("0_26_5",["德钦县","维西傈僳族自治县","香格里拉市"]);
dsy.add("0_26_6",["个旧市","河口瑶族自治县","红河县","建水县","金平苗族瑶族傣族自治县","开远市","绿春县","蒙自市","弥勒市","屏边苗族自治县","石屏县","元阳县","泸西县"]);
dsy.add("0_26_7",["华坪县","古城区","宁蒗彝族自治县","永胜县","玉龙纳西族自治县"]);
dsy.add("0_26_8",["沧源佤族自治县","凤庆县","耿马傣族佤族治县","临翔区","双江拉祜族佤族布朗族傣族自治县","永德县","云县","镇康县"]);
dsy.add("0_26_9",["福贡县","贡山独龙族怒族自治县","兰坪白族普米族自治县","泸水县"]);
dsy.add("0_26_10",["富源县","会泽县","陆良县","罗平县","马龙县","麒麟区","师宗县","宣威市","沾益县"]);
dsy.add("0_26_11",["江城哈尼族彝族自治县","景东彝族自治县","景谷彝族傣族自治县","澜沧拉祜族自治县","孟连傣族拉祜族佤族自治县","墨江哈尼族自治县","普洱哈尼族彝族自治县","思茅区","西盟佤族自治县","镇沅彝族哈尼族拉祜族自治县"]);
dsy.add("0_26_12",["富宁县","广南县","麻栗坡县","马关县","丘北县","文山市","西畴县","砚山县"]);
dsy.add("0_26_13",["景洪市","勐海县","勐腊县"]);
dsy.add("0_26_14",["澄江县","峨山彝族自治县","华宁县","江川县","通海县","新平彝族傣族自治县","易门县","红塔区","元江哈尼族彝族傣族自治县"]);
dsy.add("0_26_15",["大关县","鲁甸县","巧家县","水富县","绥江县","威信县","盐津县","彝良县","永善县","昭阳区","镇雄县"]);

dsy.add("0_27",["杭州","湖州","嘉兴","金华","丽水","宁波","绍兴","台州","温州","舟山","衢州"]);
dsy.add("0_27_0", ["拱墅区", "西湖区", "上城区", "下城区", "江干区", "滨江区", "萧山区", "余杭区", "临安市", "富阳市", "桐庐县", "建德市", "淳安县"]);
dsy.add("0_27_0_0", ["半山", "潮王路", "大关", "德胜", "德胜路", "拱宸桥", "湖墅", "和睦", "米市巷", "密度桥路", "莫干山路", "桥西", "石祥路", "小河", "香积寺路", "余杭塘上", "其他"]);
dsy.add("0_27_0_1", ["北山", "保椒路", "翠苑", "古荡", "古墩路", "黄龙", "蒋村", "教工路", "灵隐", "留下", "申花", "三墩", "文新", "文一路", "文二路", "文三路", "文三西路", "文一西路", "文二西路", "西湖", "西溪", "转塘", "其他"]);
dsy.add("0_27_0_2", ["复兴", "富春路", "丰乐桥", "湖滨", "近江", "解放桥", "葵巷", "南星", "平海路", "清波", "清江路", "望江", "吴山", "小营", "雄镇楼", "西湖大道", "佑圣观路", "紫阳", "其他"]);
dsy.add("0_27_0_3", ["北景园", "宝善", "长庆", "潮鸣", "朝晖", "德胜", "东新", "大铁栏", "凤起路", "艮山", "孩儿巷", "建国路", "三塘", "施家桥", "石桥", "天水", "体育场路", "武林", "华新路", "延安路", "中山北路", "中北路", "中北桥", "众安桥", "其他"]);
dsy.add("0_27_0_4", ["白杨", "采荷", "城东新城", "丁桥", "高沙", "海天城", "笕桥", "景芳", "九堡", "金沙湖", "凯旋", "南肖埠", "彭埠", "濮家新村", "钱江新城", "四季青", "三里亭", "三堡", "五堡", "下沙", "下沙沿江", "闸弄口", "其他"]);
dsy.add("0_27_0_5", ["长河", "彩虹桥", "东方郡", "浦沿", "西兴", "中兴", "其他"]);
dsy.add("0_27_0_6", ["北干", "城厢", "开发区", "蜀山", "闻堰", "新塘", "湘湖", "其他"]);
dsy.add("0_27_0_7", ["崇贤", "东湖", "临平", "老余杭", "良渚", "南苑", "瓶窑", "乔司", "仁和", "塘栖", "星桥", "闲林", "其他"]);
dsy.add("0_27_0_8", ["锦城", "玲珑", "青山湖", "上甘", "天目山", "其他"]);
dsy.add("0_27_0_9", ["春江", "东洲", "富春", "鹿山", "其他"]);
dsy.add("0_27_0_10", ["百江", "富春江", "分水", "风川", "横村", "旧县", "江南", "桐君", "瑶琳", "其他"]);
dsy.add("0_27_0_11", ["更楼", "新安江", "杨希", "其他"]);
dsy.add("0_27_0_12", ["大墅", "汾口", "枫树岭", "姜家", "临歧", "千岛湖", "石林", "唐村", "威坪", "文昌", "梓桐", "中洲", "其他"]);

dsy.add("0_27_1", ["安吉县", "长兴县", "德清县", "吴兴区", "南浔区"]);
dsy.add("0_27_2",["海宁市","海盐县","嘉善县","南湖区","秀洲区","平湖市","桐乡市"]);
dsy.add("0_27_3",["东阳市","婺城区","金东区","兰溪市","磐安县","浦江县","武义县","义乌市","永康市"]);
dsy.add("0_27_4",["景宁畲族自治县","莲都区","龙泉市","青田县","庆元县","松阳县","遂昌县","云和县","缙云县"]);
dsy.add("0_27_5",["慈溪市","奉化市","海曙区","江东区","江北区","北仑区","镇海区","鄞州区","宁海县","象山县","余姚市"]);
dsy.add("0_27_6",["上虞区","柯桥区","越城区","新昌县","诸暨市","嵊州市"]);
dsy.add("0_27_7",["临海市","三门县","椒江区","黄岩区","路桥区","天台县","温岭市","仙居县","玉环县"]);
dsy.add("0_27_8",["苍南县","洞头县","乐清市","平阳县","瑞安市","泰顺县","鹿城区","龙湾区","瓯海区","文成县","永嘉县"]);
dsy.add("0_27_9",["定海区","普陀区","岱山县","嵊泗县"]);
dsy.add("0_27_10",["常山县","江山市","开化县","龙游县","柯城区","衢江区"]);

dsy.add("0_28", ["兰州", "白银", "定西", "甘南藏族自治州", "嘉峪关", "金昌", "酒泉", "临夏回族自治州", "陇南", "平凉", "庆阳", "天水", "武威", "张掖"]);
dsy.add("0_28_0", ["城关区", "七里河区", "安宁区", "西固区", "红古区", "皋兰县", "永登县", "榆中县"]);
dsy.add("0_28_0_0", ["白银路", "草场街", "东岗西路", "东岗东路", "段家滩", "东部市场", "东方红广场", "伏龙坪", "贡元巷", "广武门", "鼓楼巷", "皋兰路", "拱星墩", "火车站", "黄河北", "酒泉路", "靖远路", "九州", "临夏路", "盘旋路", "铁路东村街", "铁路西村", "团结新村", "五泉", "渭源路", "五泉广场", "西关什字", "雁滩", "张掖路", "其他"]);
dsy.add("0_28_0_1", ["敦煌路", "龚家湾", "华林坪", "建兰路", "土门墩", "西湖", "西园", "西站", "晏家坪", "其他"]);
dsy.add("0_28_0_2", ["安宁西路", "安宁南路", "安宁东路", "安宁堡", "费家营", "黄河市场", "孔家崖", "刘家堡", "培黎广场", "沙井驿", "十里店", "其他"]);
dsy.add("0_28_0_3", ["陈坪", "福利路", "临洮街", "先锋路", "西固城", "西柳沟", "新城", "新和路", "新安路", "其他"]);
dsy.add("0_28_0_4", ["海石湾", "花庄", "上窑", "下窑", "其他"]);
dsy.add("0_28_0_5", ["石洞", "其他"]);
dsy.add("0_28_0_6", ["城关", "河桥", "红城", "连城", "武胜驿", "中堡", "其他"]);
dsy.add("0_28_0_7", ["城关", "高崖", "夏官营", "其他"]);

dsy.add("0_28_1", ["白银区", "平川区", "会宁县", "景泰县", "靖远县"]);
dsy.add("0_28_2",["安定区","临洮县","陇西县","通渭县","渭源县","漳县","岷县"]);
dsy.add("0_28_3",["迭部县","合作市","临潭县","碌曲县","玛曲县","夏河县","舟曲县","卓尼县"]);
dsy.add("0_28_4",["嘉峪关市"]);
dsy.add("0_28_5",["金川区","永昌县"]);
dsy.add("0_28_6",["阿克塞哈萨克族自治县","安西县","敦煌市","金塔县","肃州区","肃北蒙古族自治县","玉门市"]);
dsy.add("0_28_7",["东乡族自治县","广河县","和政县","积石山保安族东乡族撒拉族自治县","康乐县","临夏市","临夏县","永靖县"]);
dsy.add("0_28_8",["成县","徽县","康县","礼县","两当县","文县","武都区","西和县","宕昌县"]);
dsy.add("0_28_9",["崇信县","华亭县","静宁县","灵台县","崆峒区","庄浪县","泾川县"]);
dsy.add("0_28_10",["合水县","华池县","环县","宁县","庆城县","西峰区","镇原县","正宁县"]);
dsy.add("0_28_11",["甘谷县","秦安县","清水县","秦州区","麦积区","武山县","张家川回族自治县"]);
dsy.add("0_28_12",["古浪县","民勤县","天祝藏族自治县","凉州区"]);
dsy.add("0_28_13",["高台县","临泽县","民乐县","山丹县","肃南裕固族自治县","甘州区"]);

dsy.add("0_29", ["合肥", "安庆", "蚌埠", "池州", "滁州", "阜阳", "淮北", "淮南", "黄山", "六安", "马鞍山", "宿州", "铜陵", "芜湖", "宣城", "亳州"]);
dsy.add("0_29_0", ["庐阳区", "包河区", "瑶海区", "蜀山区", "长丰县", "肥东县", "肥西县", "庐江县", "巢湖市", "高新区", "新站区", "经开区", "滨湖新区"]);
dsy.add("0_29_0_0", ["安庆路", "白水坝", "百花井", "亳州路", "城隍庙", "财富广场", "阜南路", "光明", "鼓楼", "固镇路", "海棠", "和煦园", "蒙城北路", "寿春", "双岗", "市府广场", "三牌楼", "三孝口", "四牌楼", "上城国际", "宿州路", "杏林", "逍遥津", "杏花村", "益民", "其他"]);
dsy.add("0_29_0_1", ["常青", "巢湖路", "大圩", "东陈岗", "葛大店", "合工大", "骆岗", "宁国路", "南园新村", "省人大", "太宁路口", "芜湖路", "望湖城", "卫岗", "五里庙", "义兴", "义城", "中铁四局", "周谷堆", "其他"]);
dsy.add("0_29_0_2", ["车站", "城东", "长淮", "长江批发市场", "大通路", "定远路", "方庙", "和平路", "红光", "合家福购物街", "和平广场", "花冲公园", "静安新天地", "临泉东路", "龙岗", "罗岗", "郎溪路", "明光路", "七里站", "七里塘", "三里街", "胜利路", "铜陵路", "其他"]);
dsy.add("0_29_0_3", ["安徽大学", "安徽农业大学", "安医附院", "安居苑", "笔架山", "长江西路", "稻香村", "二里街", "贵池路", "琥珀山庄", "荷叶地", "黄岳路口", "怀宁路", "井岗", "机研所", "科大西区", "南七里站", "清溪路", "青阳路", "肉联厂", "三里庵", "省农机校", "石台路", "五里墩", "西园新村", "西站", "牙膏厂", "自行车厂", "轴承厂", "其他"]);
dsy.add("0_29_0_4", ["曹庵", "岗集", "水湖", "双墩", "吴山", "下塘", "杨公", "杨庙", "朱巷", "庄墓", "其他"]);
dsy.add("0_29_0_5", ["八斗", "白龙", "撮镇", "长临河", "店埠", "古城", "龙岗", "龙塘", "六家畈", "梁园", "桥头集", "石塘", "西山驿", "元疃", "其他"]);
dsy.add("0_29_0_6", ["丰乐", "高刘", "官亭", "花岗", "农兴", "上派", "三河", "山南", "桃花", "小庙", "新仓", "其他"]);
dsy.add("0_29_0_7", ["其他"]);
dsy.add("0_29_0_8", ["其他"]);
dsy.add("0_29_0_9", ["其他"]);
dsy.add("0_29_0_10", ["其他"]);

dsy.add("0_29_1", ["迎江区", "大观区", "宜秀区", "怀宁县", "潜山县", "宿松县", "太湖县", "桐城市", "望江县", "岳西县", "枞阳县"]);
dsy.add("0_29_2",["龙子湖区","蚌山区","禹会区","淮上区","固镇县","怀远县","五河县"]);
dsy.add("0_29_3",["贵池区","东至县","青阳县","石台县"]);
dsy.add("0_29_4",["琅琊区","南谯区","定远县","凤阳县","来安县","明光市","全椒县","天长市"]);
dsy.add("0_29_5",["阜南县","颍州区","颍东区","颍泉区","界首市","临泉县","太和县","颖上县"]);
dsy.add("0_29_6",["杜集区","相山区","烈山区","濉溪县"]);
dsy.add("0_29_7",["凤台县","大通区","田家庵区","谢家集区","八公山区","潘集区"]);
dsy.add("0_29_8",["屯溪区","黄山区","徽州区","祁门县","休宁县","歙县","黟县"]);
dsy.add("0_29_9",["霍邱县","霍山县","金寨县","金安区","裕安区","寿县","舒城县"]);
dsy.add("0_29_10",["当涂县","含山县","和县","花山区","雨山区","博望区"]);
dsy.add("0_29_11",["灵璧县","埇桥区","萧县","泗县","砀山县"]);
dsy.add("0_29_12",["铜官山区","狮子山区","郊区","铜陵县"]);
dsy.add("0_29_13",["繁昌县","南陵县","无为县","镜湖区","弋江区","鸠江区","鸠江区","芜湖县"]);
dsy.add("0_29_14",["广德县","绩溪县","郎溪县","宁国市","宣州区","泾县","旌德县"]);
dsy.add("0_29_15",["利辛县","蒙城县","涡阳县","谯城区"]);

dsy.add("0_30",["福州","龙岩","南平","宁德","莆田","泉州","三明","厦门","漳州"]);
dsy.add("0_30_0", ["鼓楼区", "台江区", "仓山区", "马尾区", "晋安区", "长乐市", "福清市", "连江县", "罗源县", "闽侯县", "闽清县", "平潭县", "永泰县"]);
dsy.add("0_30_0_0", ["安泰", "宝龙", "八一七北路", "白马北路", "东街", "鼓东", "鼓西", "华大", "华林路", "湖前", "津泰", "六一北路", "黎明", "南街", "水部", "省体中心", "温泉", "五凤", "五一广场", "乌山路", "五一北路", "温泉公园", "五四路", "西二环", "西湖", "西江滨", "杨桥路", "其他"]);
dsy.add("0_30_0_1", ["鳌峰", "帮洲街", "宝龙广场", "白马南路", "茶亭", "苍霞", "工业路", "后洲", "江滨中路", "六一中路", "宁化", "排尾路", "双杭", "上海", "五一南路", "新港", "西二环南路", "洋中", "义洲", "瀛洲", "元洪城", "中州岛", "中亭街", "其他"]);
dsy.add("0_30_0_2", ["白湖亭", "仓前", "对湖", "东升", "洪湾路", "金山大道", "建新路", "临江", "六一南路", "连江南路", "闽江大道", "南江滨路", "南二环路", "浦上大道", "三叉街", "上渡", "上三路", "三高路", "下渡", "则徐大道", "其他"]);
dsy.add("0_30_0_3", ["江滨东大道", "罗星", "琅岐", "马尾", "儒江", "亭江", "其他"]);
dsy.add("0_30_0_4", ["茶园", "茶会", "福马路", "福新中路", "鼓山", "火车站", "宦溪", "连江路", "前横路", "塔头", "王庄", "五四北", "五里亭", "象园", "新店", "新东区", "岳峰", "远洋路", "其他"]);
dsy.add("0_30_0_5", ["其他"]);
dsy.add("0_30_0_6", ["其他"]);
dsy.add("0_30_0_7", ["其他"]);
dsy.add("0_30_0_8", ["其他"]);
dsy.add("0_30_0_9", ["其他"]);
dsy.add("0_30_0_10", ["其他"]);

dsy.add("0_30_1",["长汀县","连城县","新罗区","上杭县","武平县","永定区","漳平市"]);
dsy.add("0_30_2",["光泽县","建阳区","建瓯市","延平区","浦城县","邵武市","顺昌县","松溪县","武夷山市","政和县"]);
dsy.add("0_30_3",["福安市","福鼎市","古田县","蕉城区","屏南县","寿宁县","霞浦县","周宁县","柘荣县"]);
dsy.add("0_30_4",["城厢区","涵江区","荔城区","秀屿区","仙游县"]);
dsy.add("0_30_5",["安溪县","德化县","惠安县","金门县","晋江市","南安市","鲤城区","丰泽区","洛江区","泉港区","石狮市","永春县"]);
dsy.add("0_30_6",["大田县","建宁县","将乐县","明溪县","宁化县","清流县","梅列区","三元区","沙县","泰宁县","永安市","尤溪县"]);
dsy.add("0_30_7",["思明区","海沧区","湖里区","集美区","同安区","翔安区"]);
dsy.add("0_30_8",["长泰县","东山县","华安县","龙海市","南靖县","平和县","云霄县","漳浦县","芗城区","龙文区","诏安县"]);
